sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
/*!
    \file    gd32a7xx_dma.c
    \brief   DMA driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_dma.h"
#include <stdlib.h>

/* DMA register bit offset */
#define CHXFCTL_FCNT_OFFSET        ((uint32_t)0x00000003U)               /*!< bit offset of FCNT in DMA_CHxFCTL */

/* DMAMUX register bit offset */
#define RM_CHXCFG_NBR_OFFSET       ((uint32_t)0x00000013U)               /*!< bit offset of NBR in DMAMUX_RM_CHXCFG */
#define RG_CHXCFG_NBRG_OFFSET      ((uint32_t)0x00000013U)               /*!< bit offset of NBRG in DMAMUX_RG_CHXCFG */

/* DMA bits mask */
#define DMA_CHXCTL_INT_MASK        ((uint32_t)0x0000001EU)               /*!< DMA_CHXCTL interrupt mask*/

/*!
    \brief      deinitialize DMA a channel registers (API_ID(0x0001U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel is deinitialized
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dma_deinit(uint32_t dma_periph, dma_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0001U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0001U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable DMA a channel */
        DMA_CHCTL(dma_periph, channelx)     &= ~DMA_CHXCTL_CHEN;
        /* reset DMA channel registers */
        DMA_CHCTL(dma_periph, channelx)      = DMA_CHCTL_RESET_VALUE;
        DMA_CHCNT(dma_periph, channelx)      = DMA_CHCNT_RESET_VALUE;
        DMA_CHPADDR(dma_periph, channelx)    = DMA_CHPADDR_RESET_VALUE;
        DMA_CHM0ADDR(dma_periph, channelx)   = DMA_CHMADDR_RESET_VALUE;
        DMA_CHM1ADDR(dma_periph, channelx)   = DMA_CHMADDR_RESET_VALUE;
        DMA_CHFCTL(dma_periph, channelx)     = DMA_CHFCTL_RESET_VALUE;;
        DMA_CHTOCTL(dma_periph, channelx)    = DMA_CHTOCTL_RESET_VALUE;
        DMA_CHPCRCDATA(dma_periph, channelx) = DMA_CHPCRCDATA_RESET_VALUE;
        DMA_TOINTF(dma_periph)               = DMA_TOINTF_RESET_VALUE;
        DMA_TOINTEN(dma_periph)              = DMA_TOINTEN_RESET_VALUE;
        DMA_TFINTF(dma_periph)               = DMA_TFINTF_RESET_VALUE;
        DMA_TFINTEN(dma_periph)              = DMA_TFINTEN_RESET_VALUE;

        if(channelx < DMA_CH4) {
            DMA_INTC0(dma_periph) |= DMA_FLAG_ADD(DMA_CHINTF_RESET_VALUE, channelx);
        }
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        else if((uint32_t)channelx < ((uint32_t)DMA_CH7 + 1U)) {
#else
        else {
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
            DMA_INTC1(dma_periph) |= DMA_FLAG_ADD(DMA_CHINTF_RESET_VALUE, (uint32_t)channelx - (uint32_t)DMA_CH4);
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        } else if(channelx < DMA_CH12) {
            DMA_INTC2(dma_periph) |= DMA_FLAG_ADD(DMA_CHINTF_RESET_VALUE, (uint32_t)channelx - (uint32_t)DMA_CH8);
        } else {
            DMA_INTC3(dma_periph) |= DMA_FLAG_ADD(DMA_CHINTF_RESET_VALUE, (uint32_t)channelx - (uint32_t)DMA_CH12);
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
        }
    }
}

/*!
    \brief      initialize the DMA single data mode parameters struct with the default values (API_ID(0x0002U))
    \param[in]  init_struct: the initialization data needed to initialize DMA channel
    \param[out] none
    \retval     none
*/
void dma_single_data_para_struct_init(dma_single_data_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set the DMA struct with the default values */
        init_struct->request              = DMA_REQUEST_M2M;
        init_struct->periph_addr          = 0U;
        init_struct->periph_inc           = DMA_PERIPH_INCREASE_DISABLE;
        init_struct->memory0_addr         = 0U;
        init_struct->memory_inc           = DMA_MEMORY_INCREASE_DISABLE;
        init_struct->periph_memory_width  = 0U;
        init_struct->periph_addr_circular = DMA_PERIPH_ADDR_CIRCULAR_DISABLE;
        init_struct->memory_addr_circular = DMA_MEMORY_ADDR_CIRCULAR_DISABLE;
        init_struct->direction            = DMA_PERIPH_TO_MEMORY;
        init_struct->number               = 0U;
        init_struct->priority             = DMA_PRIORITY_LOW;
    }
}

/*!
    \brief      initialize the DMA multi data mode parameters struct with the default values (API_ID(0x0003U))
    \param[in]  init_struct: the initialization data needed to initialize DMA channel
    \param[out] none
    \retval     none
*/
void dma_multi_data_para_struct_init(dma_multi_data_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set the DMA struct with the default values */
        init_struct->request             = DMA_REQUEST_M2M;
        init_struct->periph_addr         = 0U;
        init_struct->periph_width        = 0U;
        init_struct->periph_inc          = DMA_PERIPH_INCREASE_DISABLE;
        init_struct->memory0_addr        = 0U;
        init_struct->memory_width        = 0U;
        init_struct->memory_inc          = DMA_MEMORY_INCREASE_DISABLE;
        init_struct->memory_burst_width  = 0U;
        init_struct->periph_burst_width  = 0U;
        init_struct->periph_addr_circular = DMA_PERIPH_ADDR_CIRCULAR_DISABLE;
        init_struct->memory_addr_circular = DMA_MEMORY_ADDR_CIRCULAR_DISABLE;
        init_struct->direction           = DMA_PERIPH_TO_MEMORY;
        init_struct->number              = 0U;
        init_struct->priority            = DMA_PRIORITY_LOW;
        init_struct->critical_value      = DMA_FIFO_2_WORD;
    }
}

/*!
    \brief      initialize DMA single data mode (API_ID(0x0004U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel is initialized
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  init_struct: the data needed to initialize DMA single data mode
                  request: DMA_REQUEST_x x is the type of request
                  periph_addr: peripheral base address
                  periph_inc: DMA_PERIPH_INCREASE_ENABLE,DMA_PERIPH_INCREASE_DISABLE,DMA_PERIPH_INCREASE_FIX
                  memory0_addr: memory base address
                  memory_inc: DMA_MEMORY_INCREASE_ENABLE,DMA_MEMORY_INCREASE_DISABLE
                  periph_memory_width: DMA_PERIPH_WIDTH_8BIT, DMA_PERIPH_WIDTH_16BIT, DMA_PERIPH_WIDTH_32BIT, DMA_PERIPH_WIDTH_64BIT
                  periph_addr_circular: DMA_PERIPH_ADDR_CIRCULAR_ENABLE, DMA_PERIPH_ADDR_CIRCULAR_DISABLE
                  memory_addr_circular: DMA_MEMORY_ADDR_CIRCULAR_ENABLE, DMA_MEMORY_ADDR_CIRCULAR_DISABLE
                  direction: DMA_PERIPH_TO_MEMORY, DMA_MEMORY_TO_PERIPH, DMA_MEMORY_TO_MEMORY
                  number: the number of remaining data to be transferred by the DMA
                  priority: DMA_PRIORITY_LOW, DMA_PRIORITY_MEDIUM, DMA_PRIORITY_HIGH, DMA_PRIORITY_ULTRA_HIGH
    \param[out] none
    \retval     none
*/
void dma_single_data_mode_init(uint32_t dma_periph, dma_channel_enum channelx, dma_single_data_parameter_struct *init_struct)
{
    uint32_t ctl;

