sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else if(NOT_DMA_REQUEST(init_struct->request)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_PERIPH_INCREASE(init_struct->periph_inc)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_MEMORY_INCREASE(init_struct->memory_inc)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_PERIPH_MEMORY_WIDTH(init_struct->periph_memory_width)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_PERIPH_ADDR_CIRCULAR(init_struct->periph_addr_circular)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_MEMORY_ADDR_CIRCULAR(init_struct->memory_addr_circular)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_TRANSFER_DIRECTION(init_struct->direction)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_NUMBER(init_struct->number)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_PRIORITY(init_struct->priority)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* select single data mode */
        DMA_CHFCTL(dma_periph, channelx) &= ~DMA_CHXFCTL_MDMEN;

        /* configure peripheral base address */
        DMA_CHPADDR(dma_periph, channelx) = init_struct->periph_addr;

        /* configure memory base address */
        DMA_CHM0ADDR(dma_periph, channelx) = init_struct->memory0_addr;

        /* configure the number of remaining data to be transferred */
        DMA_CHCNT(dma_periph, channelx) = init_struct->number;

        /* configure peripheral and memory transfer width,channel priority, transfer mode */
        ctl = DMA_CHCTL(dma_periph, channelx);
        ctl &= ~(DMA_CHXCTL_PWIDTH | DMA_CHXCTL_MWIDTH | DMA_CHXCTL_PRIO | DMA_CHXCTL_TM);
        ctl |= (init_struct->periph_memory_width | (init_struct->periph_memory_width << 2) | init_struct->priority |
                init_struct->direction);
        DMA_CHCTL(dma_periph, channelx) = ctl;

        /* configure peripheral increasing mode */
        if(DMA_PERIPH_INCREASE_ENABLE == init_struct->periph_inc) {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_PNAGA;
        } else if(DMA_PERIPH_INCREASE_DISABLE == init_struct->periph_inc) {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_PNAGA;
        } else {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_PNAGA;
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_PAIF;
        }

        /* configure memory increasing mode */
        if(DMA_MEMORY_INCREASE_ENABLE == init_struct->memory_inc) {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_MNAGA;
        } else {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_MNAGA;
        }

        /* configure memory increasing mode */
        if(DMA_MEMORY_INCREASE_ENABLE == init_struct->memory_inc) {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_MNAGA;
        } else {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_MNAGA;
        }

        /* configure DMA peripheral address circular mode */
        if(DMA_PERIPH_ADDR_CIRCULAR_ENABLE == init_struct->periph_addr_circular) {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_PCEN;
        } else {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_PCEN;
        }

        /* configure DMA memory address circular mode */
        if(DMA_MEMORY_ADDR_CIRCULAR_ENABLE == init_struct->memory_addr_circular) {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_MCEN;
        } else {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_MCEN;
        }

        /* configure DMA circular mode */
        if((DMA_PERIPH_ADDR_CIRCULAR_ENABLE== init_struct->periph_addr_circular) || \
            (DMA_MEMORY_ADDR_CIRCULAR_ENABLE == init_struct->memory_addr_circular)) {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_CMEN;
        } else {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_CMEN;
        }

        if(DMA0 == dma_periph) {
            DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_MUXID;
            DMAMUX_RM_CHXCFG(channelx) |= init_struct->request;
        } else {
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            DMAMUX_RM_CHXCFG((uint32_t)channelx + 16U) &= ~DMAMUX_RM_CHXCFG_MUXID;
            DMAMUX_RM_CHXCFG((uint32_t)channelx + 16U) |= init_struct->request;
#else
            DMAMUX_RM_CHXCFG((uint32_t)channelx + 8U) &= ~DMAMUX_RM_CHXCFG_MUXID;
            DMAMUX_RM_CHXCFG((uint32_t)channelx + 8U) |= init_struct->request;
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
        }
    }
}

/*!
    \brief      initialize DMA multi data mode (API_ID(0x0005U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel is initialized
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  dma_multi_data_parameter_struct: the data needed to initialize DMA multi data mode
                  request: DMA_REQUEST_x x is the type of request
                  periph_addr: peripheral base address
                  periph_width: DMA_PERIPH_WIDTH_8BIT,DMA_PERIPH_WIDTH_16BIT,DMA_PERIPH_WIDTH_32BIT,DMA_PERIPH_WIDTH_64BIT
                  periph_inc: DMA_PERIPH_INCREASE_ENABLE,DMA_PERIPH_INCREASE_DISABLE,DMA_PERIPH_INCREASE_FIX
                  memory0_addr: memory0 base address
                  memory_width: DMA_MEMORY_WIDTH_8BIT,DMA_MEMORY_WIDTH_16BIT,DMA_MEMORY_WIDTH_32BIT,DMA_MEMORY_WIDTH_64BIT
                  memory_inc: DMA_MEMORY_INCREASE_ENABLE,DMA_MEMORY_INCREASE_DISABLE
                  memory_burst_width: DMA_MEMORY_BURST_SINGLE,DMA_MEMORY_BURST_4_BEAT,DMA_MEMORY_BURST_8_BEAT,DMA_MEMORY_BURST_16_BEAT
                  periph_burst_width: DMA_PERIPH_BURST_SINGLE,DMA_PERIPH_BURST_4_BEAT,DMA_PERIPH_BURST_8_BEAT,DMA_PERIPH_BURST_16_BEAT
                  critical_value: DMA_FIFO_2_WORD,DMA_FIFO_4_WORD,DMA_FIFO_6_WORD,DMA_FIFO_8_WORD
                  periph_addr_circular: DMA_PERIPH_ADDR_CIRCULAR_ENABLE, DMA_PERIPH_ADDR_CIRCULAR_DISABLE
                  memory_addr_circular: DMA_MEMORY_ADDR_CIRCULAR_ENABLE, DMA_MEMORY_ADDR_CIRCULAR_DISABLE
                  direction: DMA_PERIPH_TO_MEMORY,DMA_MEMORY_TO_PERIPH,DMA_MEMORY_TO_MEMORY
                  number: the number of remaining data to be transferred by the DMA
                  priority: DMA_PRIORITY_LOW,DMA_PRIORITY_MEDIUM,DMA_PRIORITY_HIGH,DMA_PRIORITY_ULTRA_HIGH
    \param[out] none
    \retval     none
*/
void dma_multi_data_mode_init(uint32_t dma_periph, dma_channel_enum channelx, dma_multi_data_parameter_struct *init_struct)
{
    uint32_t ctl;

