sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_POINTER);
    } else if(NOT_DMA_REQUEST(init_struct->request)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_PERIPH_INCREASE(init_struct->periph_inc)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_MEMORY_INCREASE(init_struct->memory_inc)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_PERIPH_WIDTH(init_struct->periph_width)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_MEMORY_WIDTH(init_struct->memory_width)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_MEMORY_BURST_WIDTH(init_struct->memory_burst_width)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_PERIPH_BURST_WIDTH(init_struct->periph_burst_width)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_FIFO_CRITICAL_VALUE(init_struct->critical_value)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_PERIPH_ADDR_CIRCULAR(init_struct->periph_addr_circular)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_MEMORY_ADDR_CIRCULAR(init_struct->memory_addr_circular)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_TRANSFER_DIRECTION(init_struct->direction)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_NUMBER(init_struct->number)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_PRIORITY(init_struct->priority)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* select multi data mode and configure FIFO critical value */
        DMA_CHFCTL(dma_periph, channelx) &= ~(DMA_CHXFCTL_FCCV);
        DMA_CHFCTL(dma_periph, channelx) |= (DMA_CHXFCTL_MDMEN | init_struct->critical_value);

        /* configure peripheral base address */
        DMA_CHPADDR(dma_periph, channelx) = init_struct->periph_addr;

        /* configure memory base address */
        DMA_CHM0ADDR(dma_periph, channelx) = init_struct->memory0_addr;

        /* configure the number of remaining data to be transferred */
        DMA_CHCNT(dma_periph, channelx) = init_struct->number;

        /* configure peripheral and memory transfer width,channel priority, transfer mode,peripheral and memory burst transfer width */
        ctl = DMA_CHCTL(dma_periph, channelx);
        ctl &= ~(DMA_CHXCTL_PWIDTH | DMA_CHXCTL_MWIDTH | DMA_CHXCTL_PRIO | DMA_CHXCTL_TM | DMA_CHXCTL_PBURST |
                 DMA_CHXCTL_MBURST);
        ctl |= (init_struct->periph_width | (init_struct->memory_width) | init_struct->priority | init_struct->direction |
                init_struct->memory_burst_width | init_struct->periph_burst_width);
        DMA_CHCTL(dma_periph, channelx) = ctl;

        /* configure peripheral increasing mode */
        if(DMA_PERIPH_INCREASE_ENABLE == init_struct->periph_inc) {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_PNAGA;
        } else if(DMA_PERIPH_INCREASE_DISABLE == init_struct->periph_inc) {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_PNAGA;
        } else {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_PNAGA;
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_PAIF;
        }

        /* configure memory increasing mode */
        if(DMA_MEMORY_INCREASE_ENABLE == init_struct->memory_inc) {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_MNAGA;
        } else {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_MNAGA;
        }

        /* configure DMA peripheral address circular mode */
        if(DMA_PERIPH_ADDR_CIRCULAR_ENABLE == init_struct->periph_addr_circular) {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_PCEN;
        } else {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_PCEN;
        }

        /* configure DMA memory address circular mode */
        if(DMA_MEMORY_ADDR_CIRCULAR_ENABLE == init_struct->memory_addr_circular) {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_MCEN;
        } else {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_MCEN;
        }

        /* configure DMA circular mode */
        if((DMA_PERIPH_ADDR_CIRCULAR_ENABLE== init_struct->periph_addr_circular) || \
            (DMA_MEMORY_ADDR_CIRCULAR_ENABLE == init_struct->memory_addr_circular)) {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_CMEN;
        } else {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_CMEN;
        }

        if(DMA0 == dma_periph) {
            DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_MUXID;
            DMAMUX_RM_CHXCFG(channelx) |= init_struct->request;
        } else {
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            DMAMUX_RM_CHXCFG((uint32_t)channelx + 16U) &= ~DMAMUX_RM_CHXCFG_MUXID;
            DMAMUX_RM_CHXCFG((uint32_t)channelx + 16U) |= init_struct->request;
#else
            DMAMUX_RM_CHXCFG((uint32_t)channelx + 8U) &= ~DMAMUX_RM_CHXCFG_MUXID;
            DMAMUX_RM_CHXCFG((uint32_t)channelx + 8U) |= init_struct->request;
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
        }
    }
}

/*!
    \brief      set DMA peripheral base address (API_ID(0x0006U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel to set peripheral base address
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  address: peripheral base address
    \param[out] none
    \retval     none
*/
void dma_periph_address_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t address)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0006U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_CHPADDR(dma_periph, channelx) = address;
    }
}

/*!
    \brief      set DMA memory base address (API_ID(0x0007U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel to set memory base address
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  memory_flag: DMA_MEMORY_x(x=0,1)
    \param[in]  address:memory base address
    \param[out] none
    \retval     none
*/
void dma_memory_address_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t memory_flag, uint32_t address)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0007U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_MEMORY_FLAG(memory_flag)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DMA_MEMORY_1 == memory_flag) {
            DMA_CHM1ADDR(dma_periph, channelx) = address;
        } else {
            DMA_CHM0ADDR(dma_periph, channelx) = address;
        }
    }
}

/*!
    \brief      set the number of remaining data to be transferred by the DMA (API_ID(0x0008U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel to set number
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  number: the number of remaining data to be transferred by the DMA
    \param[out] none
    \retval     none
*/
void dma_transfer_number_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t number)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_NUMBER(number)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_CHCNT(dma_periph, channelx) = number;
    }
}

/*!
    \brief      get the number of remaining data to be transferred by the DMA (API_ID(0x0009U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel to get number
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[out] none
    \retval     uint32_t: the number of remaining data to be transferred by the DMA
*/
uint32_t dma_transfer_number_get(uint32_t dma_periph, dma_channel_enum channelx)
{
    uint32_t reval = 0U;

