sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_TRANSFER_DIRECTION(direction)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* acquire DMA_CHxCTL register */
        ctl = DMA_CHCTL(dma_periph, channelx);
        /* assign register */
        ctl &= ~DMA_CHXCTL_TM;
        ctl |= direction;
        DMA_CHCTL(dma_periph, channelx) = ctl;
    }
}

/*!
    \brief      DMA switch buffer mode configure (API_ID(0x0016U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  memory1_addr: memory1 base address
    \param[in]  memory_select: memory select
                only one parameter can be selected which is shown as below:
      \arg        DMA_MEMORY_0
      \arg        DMA_MEMORY_1
    \param[out] none
    \retval     none
*/
void dma_switch_buffer_mode_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t memory1_addr, uint32_t memory_select)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_MEMORY_FLAG(memory_select)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure memory1 base address */
        DMA_CHM1ADDR(dma_periph, channelx) = memory1_addr;
        if(DMA_MEMORY_0 == memory_select) {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_MBS;
        } else {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_MBS;
        }
    }
}

/*!
    \brief      DMA using memory get (API_ID(0x0017U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[out] none
    \retval     the using memory
*/
uint32_t dma_using_memory_get(uint32_t dma_periph, dma_channel_enum channelx)
{
    uint32_t reval = DMA_MEMORY_0;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0017U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DMA_CHXCTL_MBS == ((DMA_CHCTL(dma_periph, channelx)) & DMA_CHXCTL_MBS)) {
            reval = DMA_MEMORY_1;
        } else {
            reval = DMA_MEMORY_0;
        }
    }
    return reval;
}

/*!
    \brief      enable dma channel peripheral address circulation function (API_ID(0x0018U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dma_peripheral_address_circulation_enable(uint32_t dma_periph, dma_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0018U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_PCEN;
    }
}

/*!
    \brief      disable dma channel peripheral address circulation function (API_ID(0x0019U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dma_peripheral_address_circulation_disable(uint32_t dma_periph, dma_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0019U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_PCEN;
    }
}

/*!
    \brief      enable dma channel memory address circulation function (API_ID(0x001AU))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dma_memory_address_circulation_enable(uint32_t dma_periph, dma_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_MCEN;
    }
}

/*!
    \brief      disable dma channel memory address circulation function (API_ID(0x001BU))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dma_memory_address_circulation_disable(uint32_t dma_periph, dma_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_MCEN;
    }
}

/*!
    \brief      enable dma channel circulation count function (API_ID(0x001CU))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dma_circulation_count_enable(uint32_t dma_periph, dma_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_CHCNT(dma_periph, channelx) |= DMA_CHXCNT_CCNTEN;
    }
}

/*!
    \brief      disable dma channel circulation count function (API_ID(0x001DU))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dma_circulation_count_disable(uint32_t dma_periph, dma_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_CHCNT(dma_periph, channelx) &= ~DMA_CHXCNT_CCNTEN;
    }
}

/*!
    \brief      configure dma channel circulation count (API_ID(0x001EU))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..7)
    \param[in]  count: circulation count
      \arg        0~255
    \param[out] none
    \retval     none
*/
void dma_circulation_count_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t count)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_CHCNT(dma_periph, channelx) &= ~DMA_CHXCNT_CCNT;
        DMA_CHCNT(dma_periph, channelx) |= (uint32_t)((uint32_t)count << 24U);
    }
}

/*!
    \brief      enable dma priority round robin function (API_ID(0x001FU))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  priority: channel priority
      \arg        DMA_RR_PRIORITY_LOW: round-robin for channels with low software priority level
      \arg        DMA_RR_PRIORITY_MEDIUM: round-robin for channels with medium software priority level
      \arg        DMA_RR_PRIORITY_HIGH: round-robin for channels with high software priority level
      \arg        DMA_RR_PRIORITY_ULTRA_HIGH: round-robin for channels with ultra high software priority level
    \param[out] none
    \retval     none
*/
void dma_round_robin_mode_enable(uint32_t dma_periph, uint32_t priority)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    } else if(NOT_DMA_RR_PRIORITY(priority)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x001FU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_GCTL(dma_periph) |= priority;
    }
}

/*!
    \brief      disable dma priority round robin function (API_ID(0x0020U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  priority: channel priority
      \arg        DMA_RR_PRIORITY_LOW: round-robin for channels with low software priority level
      \arg        DMA_RR_PRIORITY_MEDIUM: round-robin for channels with medium software priority level
      \arg        DMA_RR_PRIORITY_HIGH: round-robin for channels with high software priority level
      \arg        DMA_RR_PRIORITY_ULTRA_HIGH: round-robin for channels with ultra high software priority level
    \param[out] none
    \retval     none
*/
void dma_round_robin_mode_disable(uint32_t dma_periph, uint32_t priority)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    } else if(NOT_DMA_RR_PRIORITY(priority)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0020U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMA_GCTL(dma_periph) &= ~priority;
    }
}

/*!
    \brief      DMA flow controller configure (API_ID(0x0021U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  controller: specify DMA flow controller
                only one parameter can be selected which is shown as below:
      \arg        DMA_FLOW_CONTROLLER_DMA: DMA is the flow controller
      \arg        DMA_FLOW_CONTROLLER_PERI: peripheral is the flow controller
    \param[out] none
    \retval     none
*/
void dma_flow_controller_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t controller)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0021U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0021U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_FLOW_CONTROLLER(controller)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0021U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DMA_FLOW_CONTROLLER_DMA == controller) {
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_TFCS;
        } else {
            DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_TFCS;
        }
    }
}

/*!
    \brief      enable DMA switch buffer mode (API_ID(0x0022U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dma_switch_buffer_mode_enable(uint32_t dma_periph, dma_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0022U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0022U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* switch buffer mode enable */
        DMA_CHCTL(dma_periph, channelx) |= DMA_CHXCTL_SBMEN;
    }
}

/*!
    \brief      disable DMA switch buffer mode (API_ID(0x0023U))
    \param[in]  dma_periph: DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dma_switch_buffer_mode_disable(uint32_t dma_periph, dma_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0023U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0023U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable switch buffer mode */
        DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_SBMEN;
    }
}

/*!
    \brief      DMA FIFO status get (API_ID(0x0024U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[out] none
    \retval     the number of data stored in FIFO
                only one parameter can be selected which is shown as below:
      \arg        DMA_FIFO_CNT_0_2_DATA: 0 - 2 words
      \arg        DMA_FIFO_CNT_2_4_WORD: 2 - 4 words
      \arg        DMA_FIFO_CNT_4_6_WORD: 4 - 6 words
      \arg        DMA_FIFO_CNT_6_8_WORD: 6 - 8 words
      \arg        DMA_FIFO_CNT_EMPTY: empty
      \arg        DMA_FIFO_CNT_FULL: full
*/
uint32_t dma_fifo_status_get(uint32_t dma_periph, dma_channel_enum channelx)
{
    uint32_t reval = 0U;

