sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x002EU), ERR_PARAM_INVALID);
    } else if(NOT_DMA_TIMEOUT_THRESHOLD(threshold_value)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x002EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* acquire DMA_CHxCTL register */
        ctl = DMA_CHTOCTL(dma_periph, channelx);
        /* assign register */
        ctl &= ~DMA_CHXTOCTL_PEROID;
        ctl |= (threshold_value & DMA_CHXTOCTL_PEROID);
        DMA_CHTOCTL(dma_periph, channelx) = ctl;
    }
}

/*!
    \brief      get DMA channel transfer timeout threshold value (API_ID(0x002FU))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  threshold_value: specify transfer timeout threshold value, min 0x00000000, max 0x1FFFFF
    \param[out] none
    \retval     transfer timeout threshold value
*/
uint32_t dma_transfer_timeout_threshold_value_get(uint32_t dma_periph, dma_channel_enum channelx)
{
    uint32_t reval = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x002FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reval = (DMA_CHTOCTL(dma_periph, channelx) & DMA_CHXTOCTL_PEROID);
    }
    return reval;
}

/*!
    \brief      get DMA flag is set or not (API_ID(0x0030U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel to get flag
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  flag: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        DMA_FLAG_FEE: FIFO error and exception flag
      \arg        DMA_FLAG_SDE: single data mode exception flag
      \arg        DMA_FLAG_TAE: transfer access error flag
      \arg        DMA_FLAG_HTF: half transfer finish flag
      \arg        DMA_FLAG_FTF: full transfer finish flag
      \arg        DMA_FLAG_TIMEOUT: transfer timeout flag
      \arg        DMA_FLAG_TMR_FAULT: control register TMR fault flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dma_flag_get(uint32_t dma_periph, dma_channel_enum channelx, uint32_t flag)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0030U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0030U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_FLAG(flag)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0030U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DMA_FLAG_TIMEOUT == flag) {
            if(0U != (DMA_TOINTF(dma_periph) & ((uint32_t)1U << (uint32_t)channelx))) {
                reval = SET;
            } else {
                reval = RESET;
            }
        } else if(DMA_FLAG_TMR_FAULT == flag) {
            if(0U != (DMA_TFINTF(dma_periph) & ((uint32_t)1U << (uint32_t)channelx))) {
                reval = SET;
            } else {
                reval = RESET;
            }
        } else {
            if((uint32_t)channelx < (uint32_t)DMA_CH4) {
                if(0U != (DMA_INTF0(dma_periph) & DMA_FLAG_ADD(flag, channelx))) {
                    reval = SET;
                } else {
                    reval = RESET;
                }
            }
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            else if((uint32_t)channelx < (uint32_t)DMA_CH7 + 1U) {
#else
            else {
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
                if(0U != (DMA_INTF1(dma_periph) & DMA_FLAG_ADD(flag, (uint32_t)channelx - (uint32_t)DMA_CH4))) {
                    reval = SET;
                } else {
                    reval = RESET;
                }
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            } else if((uint32_t)channelx < (uint32_t)DMA_CH12) {
                if(0U != (DMA_INTF2(dma_periph) & DMA_FLAG_ADD(flag, (uint32_t)channelx - (uint32_t)DMA_CH8))) {
                    reval = SET;
                } else {
                    reval = RESET;
                }
            } else {
                if((0U != (DMA_INTF3(dma_periph) & DMA_FLAG_ADD(flag, (uint32_t)channelx - (uint32_t)DMA_CH12)))) {
                    reval = SET;
                } else {
                    reval = RESET;
                }
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
            }
        }
    }
    return reval;
}

/*!
    \brief      clear DMA a channel flag (API_ID(0x0031U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel to clear flag
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  flag: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        DMA_FLAG_FEE: FIFO error and exception flag
      \arg        DMA_FLAG_SDE: single data mode exception flag
      \arg        DMA_FLAG_TAE: transfer access error flag
      \arg        DMA_FLAG_HTF: half transfer finish flag
      \arg        DMA_FLAG_FTF: full transfer finish flag
      \arg        DMA_FLAG_TIMEOUT: transfer timeout flag
      \arg        DMA_FLAG_TMR_FAULT: control register TMR fault flag
    \param[out] none
    \retval     none
*/
void dma_flag_clear(uint32_t dma_periph, dma_channel_enum channelx, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0031U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_FLAG(flag)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0031U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DMA_FLAG_TIMEOUT == flag) {
            DMA_TOINTF(dma_periph) = ((uint32_t)1U << (uint32_t)channelx);
        } else if(DMA_FLAG_TMR_FAULT == flag) {
            DMA_TFINTF(dma_periph) = ((uint32_t)1U << (uint32_t)channelx);
        } else {
            if((uint32_t)channelx < (uint32_t)DMA_CH4) {
                DMA_INTC0(dma_periph) |= DMA_FLAG_ADD(flag, (uint32_t)channelx);
            }
#if defined (GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            else if((uint32_t)channelx < ((uint32_t)DMA_CH7 + (uint32_t)1U)) {
#else
            else {
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
                DMA_INTC1(dma_periph) |= DMA_FLAG_ADD(flag, (uint32_t)channelx - (uint32_t)DMA_CH4);
#if defined (GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            } else if((uint32_t)channelx < (uint32_t)DMA_CH12) {
                DMA_INTC2(dma_periph) |= DMA_FLAG_ADD(flag, (uint32_t)channelx - (uint32_t)DMA_CH8);
            } else {
                DMA_INTC3(dma_periph) |= DMA_FLAG_ADD(flag, (uint32_t)channelx - (uint32_t)DMA_CH12);
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
            }
        }
    }
}

/*!
    \brief      get DMA interrupt flag is set or not (API_ID(0x0032U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel to get interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  interrupt: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        DMA_INT_FLAG_FEE: FIFO error and exception flag
      \arg        DMA_INT_FLAG_SDE: single data mode exception flag
      \arg        DMA_INT_FLAG_TAE: transfer access error flag
      \arg        DMA_INT_FLAG_HTF: half transfer finish flag
      \arg        DMA_INT_FLAG_FTF: full transfer finish flag
      \arg        DMA_INT_FLAG_TIMEOUT: transfer timeout flag
      \arg        DMA_INT_FLAG_TMR_FAULT: control register TMR fault flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dma_interrupt_flag_get(uint32_t dma_periph, dma_channel_enum channelx, uint32_t interrupt)
{
    FlagStatus reval = RESET;

