sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0032U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_INTERRUPT_FLAG(interrupt)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0032U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t interrupt_enable = 0U, interrupt_flag = 0U;
        uint32_t channel_flag_offset = (uint32_t)channelx;
        if(DMA_INT_FLAG_TIMEOUT == interrupt) {
            interrupt_flag = DMA_TOINTF(dma_periph) & ((uint32_t)1U << (uint32_t)channelx);
            interrupt_enable = DMA_TOINTEN(dma_periph) & ((uint32_t)1U << (uint32_t)channelx);
        } else if(DMA_INT_FLAG_TMR_FAULT == interrupt) {
            interrupt_flag = DMA_TFINTF(dma_periph) & ((uint32_t)1U << (uint32_t)channelx);
            interrupt_enable = DMA_TFINTEN(dma_periph) & ((uint32_t)1U << (uint32_t)channelx);
        } else {
            if(channelx < DMA_CH4) {
                switch(interrupt) {
                case DMA_INTF_FEEIF:
                    interrupt_flag = DMA_INTF0(dma_periph) & DMA_FLAG_ADD(interrupt, channelx);
                    interrupt_enable = DMA_CHFCTL(dma_periph, channelx) & DMA_CHXFCTL_FEEIE;
                    break;
                case DMA_INTF_SDEIF:
                    interrupt_flag = DMA_INTF0(dma_periph) & DMA_FLAG_ADD(interrupt, channelx);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_SDEIE;
                    break;
                case DMA_INTF_TAEIF:
                    interrupt_flag = DMA_INTF0(dma_periph) & DMA_FLAG_ADD(interrupt, channelx);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_TAEIE;
                    break;
                case DMA_INTF_HTFIF:
                    interrupt_flag = DMA_INTF0(dma_periph) & DMA_FLAG_ADD(interrupt, channelx);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_HTFIE;
                    break;
                case DMA_INTF_FTFIF:
                    interrupt_flag = (DMA_INTF0(dma_periph) & DMA_FLAG_ADD(interrupt, channelx));
                    interrupt_enable = (DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_FTFIE);
                    break;
                default:
                    break;
                }
            }
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            else if((uint32_t)channelx < ((uint32_t)DMA_CH7 + 1U)) {
#else
            else {
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
                channel_flag_offset -= (uint32_t)DMA_CH4;
                switch(interrupt) {
                case DMA_INTF_FEEIF:
                    interrupt_flag = DMA_INTF1(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHFCTL(dma_periph, channelx) & DMA_CHXFCTL_FEEIE;
                    break;
                case DMA_INTF_SDEIF:
                    interrupt_flag = DMA_INTF1(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_SDEIE;
                    break;
                case DMA_INTF_TAEIF:
                    interrupt_flag = DMA_INTF1(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_TAEIE;
                    break;
                case DMA_INTF_HTFIF:
                    interrupt_flag = DMA_INTF1(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_HTFIE;
                    break;
                case DMA_INTF_FTFIF:
                    interrupt_flag = DMA_INTF1(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_FTFIE;
                    break;
                default:
                    break;
                }
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            } else if(channelx < DMA_CH12) {
                channel_flag_offset -= (uint32_t)DMA_CH8;
                switch(interrupt) {
                case DMA_INTF_FEEIF:
                    interrupt_flag = DMA_INTF2(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHFCTL(dma_periph, channelx) & DMA_CHXFCTL_FEEIE;
                    break;
                case DMA_INTF_SDEIF:
                    interrupt_flag = DMA_INTF2(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_SDEIE;
                    break;
                case DMA_INTF_TAEIF:
                    interrupt_flag = DMA_INTF2(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_TAEIE;
                    break;
                case DMA_INTF_HTFIF:
                    interrupt_flag = DMA_INTF2(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_HTFIE;
                    break;
                case DMA_INTF_FTFIF:
                    interrupt_flag = DMA_INTF2(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_FTFIE;
                    break;
                default:
                    break;
                }
            } else {
                channel_flag_offset -= (uint32_t)DMA_CH12;
                switch(interrupt) {
                case DMA_INTF_FEEIF:
                    interrupt_flag = DMA_INTF3(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHFCTL(dma_periph, channelx) & DMA_CHXFCTL_FEEIE;
                    break;
                case DMA_INTF_SDEIF:
                    interrupt_flag = DMA_INTF3(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_SDEIE;
                    break;
                case DMA_INTF_TAEIF:
                    interrupt_flag = DMA_INTF3(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_TAEIE;
                    break;
                case DMA_INTF_HTFIF:
                    interrupt_flag = DMA_INTF3(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_HTFIE;
                    break;
                case DMA_INTF_FTFIF:
                    interrupt_flag = DMA_INTF3(dma_periph) & DMA_FLAG_ADD(interrupt, channel_flag_offset);
                    interrupt_enable = DMA_CHCTL(dma_periph, channelx) & DMA_CHXCTL_FTFIE;
                    break;
                default:
                    break;
                }
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
            }
        }
        if((0U != interrupt_flag) && (0U != interrupt_enable)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear DMA a channel interrupt flag (API_ID(0x0033U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel to clear interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  interrupt: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        DMA_INT_FLAG_FEE: FIFO error and exception flag
      \arg        DMA_INT_FLAG_SDE: single data mode exception flag
      \arg        DMA_INT_FLAG_TAE: transfer access error flag
      \arg        DMA_INT_FLAG_HTF: half transfer finish flag
      \arg        DMA_INT_FLAG_FTF: full transfer finish flag
      \arg        DMA_INT_FLAG_TIMEOUT: transfer timeout flag
      \arg        DMA_INT_FLAG_TMR_FAULT: control register TMR fault flag
    \param[out] none
    \retval     none
*/
void dma_interrupt_flag_clear(uint32_t dma_periph, dma_channel_enum channelx, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0033U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0033U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_INTERRUPT_FLAG(interrupt)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0033U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DMA_INT_FLAG_TIMEOUT == interrupt) {
            DMA_TOINTF(dma_periph) = ((uint32_t)1U << (uint32_t)channelx);
        } else if(DMA_INT_FLAG_TMR_FAULT == interrupt) {
            DMA_TFINTF(dma_periph) = ((uint32_t)1U << (uint32_t)channelx);
        } else {
            if((uint32_t)channelx < (uint32_t)DMA_CH4) {
                DMA_INTC0(dma_periph) |= DMA_FLAG_ADD(interrupt, channelx);
            }
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            else if((uint32_t)channelx < ((uint32_t)DMA_CH7 + 1U)) {
#else
            else {
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
                DMA_INTC1(dma_periph) |= DMA_FLAG_ADD(interrupt, ((uint32_t)channelx - (uint32_t)DMA_CH4));
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            } else if((uint32_t)channelx < (uint32_t)DMA_CH12) {
                DMA_INTC2(dma_periph) |= DMA_FLAG_ADD(interrupt, ((uint32_t)channelx - (uint32_t)DMA_CH8));
            } else {
                DMA_INTC3(dma_periph) |= DMA_FLAG_ADD(interrupt, ((uint32_t)channelx - (uint32_t)DMA_CH12));
#endif /* GD32A714X or GD32A72XX or GD32A74XX */
            }
        }
    }
}

/*!
    \brief      enable DMA interrupt (API_ID(0x0034U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  interrupt: specify which interrupt to enable
                one or more parameters can be selected which are shown as below:
      \arg        DMA_INT_SDE: single data mode exception interrupt enable
      \arg        DMA_INT_TAE: transfer access error interrupt enable
      \arg        DMA_INT_HTF: half transfer finish interrupt enable
      \arg        DMA_INT_FTF: full transfer finish interrupt enable
      \arg        DMA_INT_FEE: FIFO exception interrupt enable
      \arg        DMA_INT_TIMEOUT: transfer timeout interrupt enable
      \arg        DMA_INT_TMR: control register TMR fault interrupt enable
    \param[out] none
    \retval     none
*/
void dma_interrupt_enable(uint32_t dma_periph, dma_channel_enum channelx, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0034U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0034U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_INTERRUPT(interrupt)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0034U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* enable timeout interrupt */
        if(DMA_INT_TIMEOUT == (interrupt & DMA_INT_TIMEOUT)) {
            DMA_TOINTEN(dma_periph) |= ((uint32_t)1U << (uint32_t)channelx);
        }

        /* enable control register TMR fault interrupt */
        if(DMA_INT_TMR == (interrupt & DMA_INT_TMR)) {
            DMA_TFINTEN(dma_periph) |= ((uint32_t)1U << (uint32_t)channelx);
        }

        if(DMA_CHXFCTL_FEEIE != (DMA_CHXFCTL_FEEIE & interrupt)) {
            /* enable DMA_INT_SDE or DMA_INT_TAE or DMA_INT_HTF or DMA_INT_FTF interrupt */
            DMA_CHCTL(dma_periph, channelx) |= (interrupt & DMA_CHXCTL_INT_MASK);
        } else {
            /* enable DMA_INT_SDE or DMA_INT_TAE or DMA_INT_HTF or DMA_INT_FTF or DMA_INT_FEE interrupt */
            DMA_CHFCTL(dma_periph, channelx) |= DMA_CHXFCTL_FEEIE;
            DMA_CHCTL(dma_periph, channelx) |= (interrupt & DMA_CHXCTL_INT_MASK);
        }
    }
}

/*!
    \brief      disable DMA interrupt (API_ID(0x0035U))
    \param[in]  dma_periph: DMAx(x=0,1)
      \arg        DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..15)
    \param[in]  interrupt: specify which interrupt to disable
                one or more parameters can be selected which are shown as below:
      \arg        DMA_INT_SDE: single data mode exception interrupt enable
      \arg        DMA_INT_TAE: transfer access error interrupt enable
      \arg        DMA_INT_HTF: half transfer finish interrupt enable
      \arg        DMA_INT_FTF: full transfer finish interrupt enable
      \arg        DMA_INT_FEE: FIFO exception interrupt enable
      \arg        DMA_INT_TIMEOUT: transfer timeout interrupt enable
      \arg        DMA_INT_TMR: control register TMR fault interrupt enable
    \param[out] none
    \retval     none
*/
void dma_interrupt_disable(uint32_t dma_periph, dma_channel_enum channelx, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMA_PERIPH(dma_periph)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0035U), ERR_PERIPH);
    } else if(NOT_DMA_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0035U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_INTERRUPT(interrupt)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0035U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable timeout interrupt */
        if(DMA_INT_TIMEOUT == (interrupt & DMA_INT_TIMEOUT)) {
            DMA_TOINTEN(dma_periph) &= ~(1U << (uint32_t)channelx);
        }

