sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
        /* disable control register TMR fault interrupt */
        if(DMA_INT_TMR == (interrupt & DMA_INT_TMR)) {
            DMA_TFINTEN(dma_periph) &= ~(1U << (uint32_t)channelx);
        }

        if(DMA_CHXFCTL_FEEIE != (DMA_CHXFCTL_FEEIE & interrupt)) {
            /* disable DMA_INT_SDE or DMA_INT_TAE or DMA_INT_HTF or DMA_INT_FTF interrupt */
            DMA_CHCTL(dma_periph, channelx) &= ~(interrupt & DMA_CHXCTL_INT_MASK);
        } else {
            /* disable DMA_INT_SDE or DMA_INT_TAE or DMA_INT_HTF or DMA_INT_FTF or DMA_INT_FEE interrupt */
            DMA_CHFCTL(dma_periph, channelx) &= ~DMA_CHXFCTL_FEEIE;
            DMA_CHCTL(dma_periph, channelx) &= ~(interrupt & DMA_CHXCTL_INT_MASK);
        }
    }
}

/*!
    \brief      initialize the parameters of DMAMUX synchronization mode structure with the default values (API_ID(0x0036U))
    \param[in]  none
    \param[out] init_struct: the initialization data needed to initialize DMAMUX request multiplexer channel synchronization mode
    \retval     none
*/
void dmamux_sync_struct_para_init(dmamux_sync_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0036U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set the DMAMUX synchronization struct with the default values */
        init_struct->sync_id        = DMAMUX_SYNC_EVT0_OUT;
        init_struct->sync_polarity  = DMAMUX_SYNC_RISING;
        init_struct->request_number = 1U;
    }
}

/*!
    \brief      initialize DMAMUX request multiplexer channel synchronization mode (API_ID(0x0037U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is initialized
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..31)
    \param[in]  init_struct: the data needed to initialize DMAMUX request multiplexer channel
                  sync_id: DMAMUX_SYNC_EXTI0, DMAMUX_SYNC_EXTI1, DMAMUX_SYNC_EXTI2, DMAMUX_SYNC_EXTI3, DMAMUX_SYNC_EXTI4, DMAMUX_SYNC_EXTI5, DMAMUX_SYNC_EXTI6,
                           DMAMUX_SYNC_EXTI7, DMAMUX_SYNC_EXTI8, DMAMUX_SYNC_EXTI9, DMAMUX_SYNC_EXTI10, DMAMUX_SYNC_EXTI11, DMAMUX_SYNC_EXTI12, DMAMUX_SYNC_EXTI13,
                           DMAMUX_SYNC_EXTI14, DMAMUX_SYNC_EXTI15, DMAMUX_SYNC_EVT0_OUT, DMAMUX_SYNC_EVT1_OUT, DMAMUX_SYNC_EVT2_OUT, DMAMUX_SYNC_EVT3_OUT, DMAMUX_SYNC_EVT4_OUT,
                           DMAMUX_SYNC_EVT5_OUT, DMAMUX_SYNC_EVT6_OUT, DMAMUX_SYNC_EVT7_OUT, DMAMUX_SYNC_TIMER1_TRGO
                  sync_polarity: DMAMUX_SYNC_NO_EVENT, DMAMUX_SYNC_RISING, DMAMUX_SYNC_FALLING, DMAMUX_SYNC_RISING_FALLING
                  request_number: the number of DMA request that will be authorized after a sync event, from 1 to 32
    \param[out] none
    \retval     none
*/
void dmamux_synchronization_init(dmamux_multiplexer_channel_enum channelx, dmamux_sync_parameter_struct *init_struct)
{
    uint32_t cfg;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_MULTIPLEXER_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0037U), ERR_PARAM_INVALID);
    } else if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0037U), ERR_PARAM_POINTER);
    } else if(NOT_DMAMUX_SYNC_ID(init_struct->sync_id)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0037U), ERR_PARAM_INVALID);
    } else if(NOT_DMAMUX_SYNC_POLARITY(init_struct->sync_polarity)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0037U), ERR_PARAM_INVALID);
    } else if(NOT_DMAMUX_REQUEST_NUMBER(init_struct->request_number)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0037U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable synchronization mode and event generation for DMA request forward number configuration */
        DMAMUX_RM_CHXCFG(channelx) &= ~(DMAMUX_RM_CHXCFG_SYNCEN | DMAMUX_RM_CHXCFG_EVGEN | DMAMUX_RM_CHXCFG_SOIE);

        /* configure synchronization input identification, synchronization input polarity, number of DMA requests to forward */
        cfg = DMAMUX_RM_CHXCFG(channelx);
        cfg &= ~(DMAMUX_RM_CHXCFG_SYNCID | DMAMUX_RM_CHXCFG_NBR | DMAMUX_RM_CHXCFG_SYNCP);
        cfg |= (init_struct->sync_polarity | (init_struct->sync_id) | RM_CHXCFG_NBR(init_struct->request_number - 1U));
        DMAMUX_RM_CHXCFG(channelx) = cfg;
    }
}

/*!
    \brief      enable synchronization mode (API_ID(0x0038U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..31)
    \param[out] none
    \retval     none
*/
void dmamux_synchronization_enable(dmamux_multiplexer_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_MULTIPLEXER_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0038U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RM_CHXCFG(channelx) |= DMAMUX_RM_CHXCFG_SYNCEN;
    }
}

/*!
    \brief      disable synchronization mode (API_ID(0x0039U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..31)
    \param[out] none
    \retval     none
*/
void dmamux_synchronization_disable(dmamux_multiplexer_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_MULTIPLEXER_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0039U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RM_CHXCFG(channelx) &= (~DMAMUX_RM_CHXCFG_SYNCEN);
    }
}
/*!
    \brief      enable event generation (API_ID(0x003AU))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..31)
    \param[out] none
    \retval     none
*/
void dmamux_event_generation_enable(dmamux_multiplexer_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_MULTIPLEXER_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x003AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RM_CHXCFG(channelx) |= DMAMUX_RM_CHXCFG_EVGEN;
    }
}

/*!
    \brief      disable event generation (API_ID(0x003BU))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..31)
    \param[out] none
    \retval     none
*/
void dmamux_event_generation_disable(dmamux_multiplexer_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_MULTIPLEXER_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x003BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RM_CHXCFG(channelx) &= (~DMAMUX_RM_CHXCFG_EVGEN);
    }
}

/*!
    \brief      initialize the parameters of DMAMUX request generator structure with the default values (API_ID(0x003CU))
    \param[in]  init_struct: the initialization data needed to initialize DMAMUX request generator channel
    \param[out] none
    \retval     none
*/
void dmamux_gen_struct_para_init(dmamux_gen_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x003CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set the DMAMUX request generator structure with the default values */
        init_struct->trigger_id        = DMAMUX_TRIGGER_EXTI0;
        init_struct->trigger_polarity  = DMAMUX_GEN_RISING;
        init_struct->request_number    = 1U;
    }
}

/*!
    \brief      initialize DMAMUX request generator channel (API_ID(0x003DU))
    \param[in]  channelx: specify which DMAMUX request generator channel is initialized
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[in]  init_struct: the data needed to initialize DMAMUX request generator channel
                  trigger_id: DMAMUX_TRIGGER_EXTI0, DMAMUX_TRIGGER_EXTI1, DMAMUX_TRIGGER_EXTI2, DMAMUX_TRIGGER_EXTI3, DMAMUX_TRIGGER_EXTI4, DMAMUX_TRIGGER_EXTI5,
                              DMAMUX_TRIGGER_EXTI6, DMAMUX_TRIGGER_EXTI7, DMAMUX_TRIGGER_EXTI8, DMAMUX_TRIGGER_EXTI9, DMAMUX_TRIGGER_EXTI10, DMAMUX_TRIGGER_EXTI11,
                              DMAMUX_TRIGGER_EXTI12, DMAMUX_TRIGGER_EXTI13, DMAMUX_TRIGGER_EXTI14, DMAMUX_TRIGGER_EXTI15, DMAMUX_TRIGGER_EVT0_OUT, DMAMUX_TRIGGER_EVT1_OUT,
                              DMAMUX_TRIGGER_EVT2_OUT, DMAMUX_TRIGGER_EVT3_OUT, DMAMUX_TRIGGER_EVT4_OUT, DMAMUX_TRIGGER_EVT5_OUT, DMAMUX_TRIGGER_EVT6_OUT, DMAMUX_TRIGGER_EVT7_OUT,
                              DMAMUX_TRIGGER_TIMER1_TRGO
                  trigger_polarity: DMAMUX_GEN_NO_EVENT, DMAMUX_GEN_RISING, DMAMUX_GEN_FALLING, DMAMUX_GEN_RISING_FALLING
                  request_number: the number of DMA request that will be generated after a signal event, from 1 to 32
    \param[out] none
    \retval     none
*/
void dmamux_request_generator_init(dmamux_generator_channel_enum channelx, dmamux_gen_parameter_struct *init_struct)
{
    uint32_t cfg;

