sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_GENERATOR_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x003DU), ERR_PARAM_POINTER);
    } else if(NOT_DMAMUX_TRIGGER_ID(init_struct->trigger_id)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else if(NOT_DMAMUX_TRIGGER_POLARITY(init_struct->trigger_polarity)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else if(NOT_DMAMUX_REQUEST_NUMBER(init_struct->request_number)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable DMAMUX request generator channel for DMA request generation number configuration */
        DMAMUX_RG_CHXCFG(channelx) &= ~(DMAMUX_RG_CHXCFG_RGEN | DMAMUX_RG_CHXCFG_TOIE);

        /* configure trigger input identification, trigger polarity, number of DMA requests to be generated */
        cfg = DMAMUX_RG_CHXCFG(channelx);
        cfg &= ~(DMAMUX_RG_CHXCFG_TID | DMAMUX_RG_CHXCFG_NBRG | DMAMUX_RG_CHXCFG_RGTP);
        cfg |= (RG_CHXCFG_NBRG(init_struct->request_number - 1U) | init_struct->trigger_id | init_struct->trigger_polarity);
        DMAMUX_RG_CHXCFG(channelx) = cfg;
    }
}

/*!
    \brief      enable DMAMUX request generator channel (API_ID(0x003EU))
    \param[in]  channelx: specify which DMAMUX request generator channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dmamux_request_generator_channel_enable(dmamux_generator_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_GENERATOR_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x003EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RG_CHXCFG(channelx) |= DMAMUX_RG_CHXCFG_RGEN;
    }
}

/*!
    \brief      disable DMAMUX request generator channel (API_ID(0x003FU))
    \param[in]  channelx: specify which DMAMUX request generator channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dmamux_request_generator_channel_disable(dmamux_generator_channel_enum channelx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_GENERATOR_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x003FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RG_CHXCFG(channelx) &= (~DMAMUX_RG_CHXCFG_RGEN);
    }
}

/*!
    \brief      configure synchronization input polarity (API_ID(0x0040U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..31)
    \param[in]  polarity: synchronization input polarity
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_SYNC_NO_EVENT: no event detection
      \arg        DMAMUX_SYNC_RISING: rising edge
      \arg        DMAMUX_SYNC_FALLING: falling edge
      \arg        DMAMUX_SYNC_RISING_FALLING: rising and falling edges
    \param[out] none
    \retval     none
*/
void dmamux_synchronization_polarity_config(dmamux_multiplexer_channel_enum channelx, uint32_t polarity)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_MULTIPLEXER_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0040U), ERR_PARAM_INVALID);
    } else if(NOT_DMAMUX_SYNC_POLARITY(polarity)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0040U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_SYNCP;
        DMAMUX_RM_CHXCFG(channelx) |= polarity;
    }
}

/*!
    \brief      configure number of DMA requests to forward (API_ID(0x0041U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..31)
    \param[in]  number: DMA requests number to forward
      \arg        1 - 32
    \param[out] none
    \retval     none
*/
void dmamux_request_forward_number_config(dmamux_multiplexer_channel_enum channelx, uint32_t number)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_MULTIPLEXER_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0041U), ERR_PARAM_INVALID);
    } else if(NOT_DMAMUX_REQUEST_NUMBER(number)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0041U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_NBR;
        DMAMUX_RM_CHXCFG(channelx) |= ((number - 1U) << RM_CHXCFG_NBR_OFFSET);
    }
}

/*!
    \brief      configure synchronization input identification (API_ID(0x0042U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..31)
    \param[in]  id: synchronization input identification
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_SYNC_EXTI0      : synchronization input is EXTI0
      \arg        DMAMUX_SYNC_EXTI1      : synchronization input is EXTI1
      \arg        DMAMUX_SYNC_EXTI2      : synchronization input is EXTI2
      \arg        DMAMUX_SYNC_EXTI3      : synchronization input is EXTI3
      \arg        DMAMUX_SYNC_EXTI4      : synchronization input is EXTI4
      \arg        DMAMUX_SYNC_EXTI5      : synchronization input is EXTI5
      \arg        DMAMUX_SYNC_EXTI6      : synchronization input is EXTI6
      \arg        DMAMUX_SYNC_EXTI7      : synchronization input is EXTI7
      \arg        DMAMUX_SYNC_EXTI8      : synchronization input is EXTI8
      \arg        DMAMUX_SYNC_EXTI9      : synchronization input is EXTI9
      \arg        DMAMUX_SYNC_EXTI10     : synchronization input is EXTI10
      \arg        DMAMUX_SYNC_EXTI11     : synchronization input is EXTI11
      \arg        DMAMUX_SYNC_EXTI12     : synchronization input is EXTI12
      \arg        DMAMUX_SYNC_EXTI13     : synchronization input is EXTI13
      \arg        DMAMUX_SYNC_EXTI14     : synchronization input is EXTI14
      \arg        DMAMUX_SYNC_EXTI15     : synchronization input is EXTI15
      \arg        DMAMUX_SYNC_EVT0_OUT   : synchronization input is Evt0_out
      \arg        DMAMUX_SYNC_EVT1_OUT   : synchronization input is Evt1_out
      \arg        DMAMUX_SYNC_EVT2_OUT   : synchronization input is Evt2_out
      \arg        DMAMUX_SYNC_EVT3_OUT   : synchronization input is Evt3_out
      \arg        DMAMUX_SYNC_EVT4_OUT   : synchronization input is Evt4_out
      \arg        DMAMUX_SYNC_EVT5_OUT   : synchronization input is Evt5_out
      \arg        DMAMUX_SYNC_EVT6_OUT   : synchronization input is Evt6_out
      \arg        DMAMUX_SYNC_EVT7_OUT   : synchronization input is Evt7_out
      \arg        DMAMUX_SYNC_TIMER1_TRGO: synchronization input is TIMER1_TRGO
    \param[out] none
    \retval     none
*/
void dmamux_sync_id_config(dmamux_multiplexer_channel_enum channelx, uint32_t id)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_MULTIPLEXER_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0042U), ERR_PARAM_INVALID);
    } else if(NOT_DMAMUX_SYNC_ID(id)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0042U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_SYNCID;
        DMAMUX_RM_CHXCFG(channelx) |= id;
    }
}

