sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
/*!
    \brief      configure multiplexer input identification (API_ID(0x0043U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..31)
    \param[in]  id: input DMA request identification
                only one parameter can be selected which is shown as below:
      \arg        DMA_REQUEST_M2M: memory to memory transfer
      \arg        DMA_REQUEST_GENERATOR0: DMAMUX request generator 0
      \arg        DMA_REQUEST_GENERATOR1: MAMUX request generator 1
      \arg        DMA_REQUEST_GENERATOR2: MAMUX request generator 2
      \arg        DMA_REQUEST_GENERATOR3: MAMUX request generator 3
      \arg        DMA_REQUEST_GENERATOR4: MAMUX request generator 4
      \arg        DMA_REQUEST_GENERATOR5: MAMUX request generator 5
      \arg        DMA_REQUEST_GENERATOR6: MAMUX request generator 6
      \arg        DMA_REQUEST_GENERATOR7: MAMUX request generator 7
      \arg        DMA_REQUEST_DAC0: DMAMUX DAC0 request
      \arg        DMA_REQUEST_DAC1: DMAMUX DAC1 request
      \arg        DMA_REQUEST_TIMER5_UP0: DMAMUX TIMER5 UP0 request
      \arg        DMA_REQUEST_TIMER6_UP0: DMAMUX TIMER6 UP0 request
      \arg        DMA_REQUEST_SPI0_RX: DMAMUX SPI0 RX request
      \arg        DMA_REQUEST_SPI0_TX: DMAMUX SPI0 TX request
      \arg        DMA_REQUEST_SPI1_RX: DMAMUX SPI1 RX request
      \arg        DMA_REQUEST_SPI1_TX: DMAMUX SPI1 TX request
      \arg        DMA_REQUEST_SPI2_RX: DMAMUX SPI2 RX request
      \arg        DMA_REQUEST_SPI2_TX: DMAMUX SPI2 TX request
      \arg        DMA_REQUEST_SPI3_RX: DMAMUX SPI3 RX request
      \arg        DMA_REQUEST_SPI3_TX: DMAMUX SPI3 TX request
      \arg        DMA_REQUEST_SPI4_I2S_RX: DMAMUX SPI4 I2S RX request
      \arg        DMA_REQUEST_SPI4_I2S_TX: DMAMUX SPI4 I2S TX request
      \arg        DMA_REQUEST_SPI5_I2S_RX: DMAMUX SPI5 I2S RX request
      \arg        DMA_REQUEST_SPI5_I2S_TX: DMAMUX SPI5 I2S TX request
      \arg        DMA_REQUEST_I2C0_RX: DMAMUX I2C0 RX request
      \arg        DMA_REQUEST_I2C0_TX: DMAMUX I2C0 TX request
      \arg        DMA_REQUEST_I2C1_RX: DMAMUX I2C1 RX request
      \arg        DMA_REQUEST_I2C1_TX: DMAMUX I2C1 TX request
      \arg        DMA_REQUEST_SPI6_I2S_RX: DMAMUX SPI6 I2S RX request
      \arg        DMA_REQUEST_SPI6_I2S_TX: DMAMUX SPI6 I2S TX request
      \arg        DMA_REQUEST_SPI7_I2S_RX: DMAMUX SPI7 I2S RX request
      \arg        DMA_REQUEST_SPI7_I2S_TX: DMAMUX SPI7 I2S TX request
      \arg        DMA_REQUEST_LINFLEXD0_RX: DMAMUX LINFLEXD0 RX request
      \arg        DMA_REQUEST_LINFLEXD0_TX: DMAMUX LINFLEXD0 TX request
      \arg        DMA_REQUEST_LINFLEXD1_RX: DMAMUX LINFLEXD1 RX request
      \arg        DMA_REQUEST_LINFLEXD1_TX: DMAMUX LINFLEXD1 TX request
      \arg        DMA_REQUEST_LINFLEXD2_RX: DMAMUX LINFLEXD2 RX request
      \arg        DMA_REQUEST_LINFLEXD2_TX: DMAMUX LINFLEXD2 TX request
      \arg        DMA_REQUEST_LINFLEXD3_RX: DMAMUX LINFLEXD3 RX request
      \arg        DMA_REQUEST_LINFLEXD3_TX: DMAMUX LINFLEXD3 TX request
      \arg        DMA_REQUEST_LINFLEXD4_RX: DMAMUX LINFLEXD4 RX request
      \arg        DMA_REQUEST_LINFLEXD4_TX: DMAMUX LINFLEXD4 TX request
      \arg        DMA_REQUEST_LINFLEXD5_RX: DMAMUX LINFLEXD5 RX request
      \arg        DMA_REQUEST_LINFLEXD5_TX: DMAMUX LINFLEXD5 TX request
      \arg        DMA_REQUEST_LINFLEXD6_RX: DMAMUX LINFLEXD6 RX request
      \arg        DMA_REQUEST_LINFLEXD6_TX: DMAMUX LINFLEXD6 TX request
      \arg        DMA_REQUEST_LINFLEXD7_RX: DMAMUX LINFLEXD7 RX request
      \arg        DMA_REQUEST_LINFLEXD7_TX: DMAMUX LINFLEXD7 TX request
      \arg        DMA_REQUEST_LINFLEXD8_RX: DMAMUX LINFLEXD8 RX request
      \arg        DMA_REQUEST_LINFLEXD8_TX: DMAMUX LINFLEXD8 TX request
      \arg        DMA_REQUEST_LINFLEXD9_RX: DMAMUX LINFLEXD9 RX request
      \arg        DMA_REQUEST_LINFLEXD9_TX: DMAMUX LINFLEXD9 TX request
      \arg        DMA_REQUEST_LINFLEXD10_RX: DMAMUX LINFLEXD10 RX request
      \arg        DMA_REQUEST_LINFLEXD10_TX: DMAMUX LINFLEXD10 TX request
      \arg        DMA_REQUEST_LINFLEXD11_RX: DMAMUX LINFLEXD11 RX request
      \arg        DMA_REQUEST_LINFLEXD11_TX: DMAMUX LINFLEXD11 TX request
      \arg        DMA_REQUEST_TIMER0_CH0: DMAMUX TIMER0 CH0 request
      \arg        DMA_REQUEST_TIMER0_CH1: DMAMUX TIMER0 CH1 request
      \arg        DMA_REQUEST_TIMER0_CH2: DMAMUX TIMER0 CH2 request
      \arg        DMA_REQUEST_TIMER0_CH3: DMAMUX TIMER0 CH3 request
      \arg        DMA_REQUEST_TIMER0_CH0N: DMAMUX TIMER0 CH0N request
      \arg        DMA_REQUEST_TIMER0_CH1N: DMAMUX TIMER0 CH1N request
      \arg        DMA_REQUEST_TIMER0_CH2N: DMAMUX TIMER0 CH2N request
      \arg        DMA_REQUEST_TIMER0_CH3N: DMAMUX TIMER0 CH3N request
      \arg        DMA_REQUEST_TIMER0_UP: DMAMUX TIMER0 UP request
      \arg        DMA_REQUEST_TIMER0_TRG: DMAMUX TIMER0 TRG request
      \arg        DMA_REQUEST_TIMER0_CMT: DMAMUX TIMER0 CMT request
      \arg        DMA_REQUEST_TIMER7_CH0: DMAMUX TIMER7 CH0 request
      \arg        DMA_REQUEST_TIMER7_CH1: DMAMUX TIMER7 CH1 request
      \arg        DMA_REQUEST_TIMER7_CH2: DMAMUX TIMER7 CH2 request
      \arg        DMA_REQUEST_TIMER7_CH3: DMAMUX TIMER7 CH3 request
      \arg        DMA_REQUEST_TIMER7_CH0N: DMAMUX TIMER7 CH0N request
      \arg        DMA_REQUEST_TIMER7_CH1N: DMAMUX TIMER7 CH1N request
      \arg        DMA_REQUEST_TIMER7_CH2N: DMAMUX TIMER7 CH2N request
      \arg        DMA_REQUEST_TIMER7_CH3N: DMAMUX TIMER7 CH3N request
      \arg        DMA_REQUEST_TIMER7_TRG: DMAMUX TIMER7 TRG request
      \arg        DMA_REQUEST_TIMER7_UP: DMAMUX TIMER7 UP request
      \arg        DMA_REQUEST_TIMER7_CMT: DMAMUX TIMER7 CMT request
      \arg        DMA_REQUEST_TIMER19_CH0: DMAMUX TIMER19 CH0 request
      \arg        DMA_REQUEST_TIMER19_CH1: DMAMUX TIMER19 CH1 request
      \arg        DMA_REQUEST_TIMER19_CH2: DMAMUX TIMER19 CH2 request
      \arg        DMA_REQUEST_TIMER19_CH3: DMAMUX TIMER19 CH3 request
      \arg        DMA_REQUEST_TIMER19_CH0N: DMAMUX TIMER19 CH0N request
      \arg        DMA_REQUEST_TIMER19_CH1N: DMAMUX TIMER19 CH1N request
      \arg        DMA_REQUEST_TIMER19_CH2N: DMAMUX TIMER19 CH2N request
      \arg        DMA_REQUEST_TIMER19_CH3N: DMAMUX TIMER19 CH3N request
      \arg        DMA_REQUEST_TIMER19_UP: DMAMUX TIMER19 UP request
      \arg        DMA_REQUEST_TIMER19_TRG: DMAMUX TIMER19 TRG request
      \arg        DMA_REQUEST_TIMER19_CMT: DMAMUX TIMER19 CMT request
      \arg        DMA_REQUEST_TIMER20_CH0: DMAMUX TIMER20 CH0 request
      \arg        DMA_REQUEST_TIMER20_CH1: DMAMUX TIMER20 CH1 request
      \arg        DMA_REQUEST_TIMER20_CH2: DMAMUX TIMER20 CH2 request
      \arg        DMA_REQUEST_TIMER20_CH3: DMAMUX TIMER20 CH3 request
      \arg        DMA_REQUEST_TIMER20_CH0N: DMAMUX TIMER20 CH0N request
      \arg        DMA_REQUEST_TIMER20_CH1N: DMAMUX TIMER20 CH1N request
      \arg        DMA_REQUEST_TIMER20_CH2N: DMAMUX TIMER20 CH2N request
      \arg        DMA_REQUEST_TIMER20_CH3N: DMAMUX TIMER20 CH3N request
      \arg        DMA_REQUEST_TIMER20_UP: DMAMUX TIMER20 UP request
      \arg        DMA_REQUEST_TIMER20_TRG: DMAMUX TIMER20 TRG request
      \arg        DMA_REQUEST_TIMER20_CMT: DMAMUX TIMER20 CMT request
      \arg        DMA_REQUEST_TIMER60_CH0: DMAMUX TIMER60 CH0 request
      \arg        DMA_REQUEST_TIMER60_CH1: DMAMUX TIMER60 CH1 request
      \arg        DMA_REQUEST_TIMER60_CH2: DMAMUX TIMER60 CH2 request
      \arg        DMA_REQUEST_TIMER60_CH3: DMAMUX TIMER60 CH3 request
      \arg        DMA_REQUEST_TIMER60_CH0N: DMAMUX TIMER60 CH0N request
      \arg        DMA_REQUEST_TIMER60_CH1N: DMAMUX TIMER60 CH1N request
      \arg        DMA_REQUEST_TIMER60_CH2N: DMAMUX TIMER60 CH2N request
      \arg        DMA_REQUEST_TIMER60_CH3N: DMAMUX TIMER60 CH3N request
      \arg        DMA_REQUEST_TIMER60_UP: DMAMUX TIMER60 UP request
      \arg        DMA_REQUEST_TIMER60_TRG: DMAMUX TIMER60 TRG request
      \arg        DMA_REQUEST_TIMER60_CMT: DMAMUX TIMER60 CMT request
      \arg        DMA_REQUEST_TIMER61_CH0: DMAMUX TIMER61 CH0 request
      \arg        DMA_REQUEST_TIMER61_CH1: DMAMUX TIMER61 CH1 request
      \arg        DMA_REQUEST_TIMER61_CH2: DMAMUX TIMER61 CH2 request
      \arg        DMA_REQUEST_TIMER61_CH3: DMAMUX TIMER61 CH3 request
      \arg        DMA_REQUEST_TIMER61_CH0N: DMAMUX TIMER61 CH0N request
      \arg        DMA_REQUEST_TIMER61_CH1N: DMAMUX TIMER61 CH1N request
      \arg        DMA_REQUEST_TIMER61_CH2N: DMAMUX TIMER61 CH2N request
      \arg        DMA_REQUEST_TIMER61_CH3N: DMAMUX TIMER61 CH3N request
      \arg        DMA_REQUEST_TIMER61_UP: DMAMUX TIMER61 UP request
      \arg        DMA_REQUEST_TIMER61_TRG: DMAMUX TIMER61 TRG request
      \arg        DMA_REQUEST_TIMER61_CMT: DMAMUX TIMER61 CMT request
      \arg        DMA_REQUEST_TIMER62_CH0: DMAMUX TIMER62 CH0 request
      \arg        DMA_REQUEST_TIMER62_CH1: DMAMUX TIMER62 CH1 request
      \arg        DMA_REQUEST_TIMER62_CH2: DMAMUX TIMER62 CH2 request
      \arg        DMA_REQUEST_TIMER62_CH3: DMAMUX TIMER62 CH3 request
      \arg        DMA_REQUEST_TIMER62_CH0N: DMAMUX TIMER62 CH0N request
      \arg        DMA_REQUEST_TIMER62_CH1N: DMAMUX TIMER62 CH1N request
      \arg        DMA_REQUEST_TIMER62_CH2N: DMAMUX TIMER62 CH2N request
      \arg        DMA_REQUEST_TIMER62_CH3N: DMAMUX TIMER62 CH3N request
      \arg        DMA_REQUEST_TIMER62_UP: DMAMUX TIMER62 UP request
      \arg        DMA_REQUEST_TIMER62_TRG: DMAMUX TIMER62 TRG request
      \arg        DMA_REQUEST_TIMER62_CMT: DMAMUX TIMER62 CMT request
      \arg        DMA_REQUEST_TIMER63_CH0: DMAMUX TIMER63 CH0 request
      \arg        DMA_REQUEST_TIMER63_CH1: DMAMUX TIMER63 CH1 request
      \arg        DMA_REQUEST_TIMER63_CH2: DMAMUX TIMER63 CH2 request
      \arg        DMA_REQUEST_TIMER63_CH3: DMAMUX TIMER63 CH3 request
      \arg        DMA_REQUEST_TIMER63_CH0N: DMAMUX TIMER63 CH0N request
      \arg        DMA_REQUEST_TIMER63_CH1N: DMAMUX TIMER63 CH1N request
      \arg        DMA_REQUEST_TIMER63_CH2N: DMAMUX TIMER63 CH2N request
      \arg        DMA_REQUEST_TIMER63_CH3N: DMAMUX TIMER63 CH3N request
      \arg        DMA_REQUEST_TIMER63_UP: DMAMUX TIMER63 UP request
      \arg        DMA_REQUEST_TIMER63_TRG: DMAMUX TIMER63 TRG request
      \arg        DMA_REQUEST_TIMER63_CMT: DMAMUX TIMER63 CMT request
      \arg        DMA_REQUEST_TIMER1_CH0: DMAMUX TIMER1 CH0 request
      \arg        DMA_REQUEST_TIMER1_CH1: DMAMUX TIMER1 CH1 request
      \arg        DMA_REQUEST_TIMER1_CH2: DMAMUX TIMER1 CH2 request
      \arg        DMA_REQUEST_TIMER1_CH3: DMAMUX TIMER1 CH3 request
      \arg        DMA_REQUEST_TIMER1_UP: DMAMUX TIMER1 UP request
      \arg        DMA_REQUEST_TIMER1_TRG: DMAMUX TIMER1 TRG request
      \arg        DMA_REQUEST_TIMER2_CH0: DMAMUX TIMER2 CH0 request
      \arg        DMA_REQUEST_TIMER2_CH1: DMAMUX TIMER2 CH1 request
      \arg        DMA_REQUEST_TIMER2_CH2: DMAMUX TIMER2 CH2 request
      \arg        DMA_REQUEST_TIMER2_CH3: DMAMUX TIMER2 CH3 request
      \arg        DMA_REQUEST_TIMER2_UP: DMAMUX TIMER2 UP request
      \arg        DMA_REQUEST_TIMER2_TRG: DMAMUX TIMER2 TRG request
      \arg        DMA_REQUEST_QSPI: DMAMUX QSPI request
      \arg        DMA_REQUEST_MFCOM0: DMAMUX MFCOM0 request
      \arg        DMA_REQUEST_MFCOM1: DMAMUX MFCOM1 request
      \arg        DMA_REQUEST_MFCOM2: DMAMUX MFCOM2 request
      \arg        DMA_REQUEST_MFCOM3: DMAMUX MFCOM3 request
      \arg        DMA_REQUEST_DTM_CAN0_RX0: DMAMUX DTM_CAN0_RX0 request
      \arg        DMA_REQUEST_DTM_CAN0_RX1: DMAMUX DTM_CAN0_RX1 request
      \arg        DMA_REQUEST_DTM_CAN0_TX: DMAMUX DTM_CAN0_TX request
      \arg        DMA_REQUEST_DTM_CAN0_TXE: DMAMUX DTM_CAN0_TXE request
      \arg        DMA_REQUEST_DTM_CAN1_RX0: DMAMUX DTM_CAN1_RX0 request
      \arg        DMA_REQUEST_DTM_CAN1_RX1: DMAMUX DTM_CAN1_RX1 request
      \arg        DMA_REQUEST_DTM_CAN1_TX: DMAMUX DTM_CAN1_TX request
      \arg        DMA_REQUEST_DTM_CAN1_TXE: DMAMUX DTM_CAN1_TXE request
      \arg        DMA_REQUEST_ADC0ROUTINE: DMAMUX ADC0ROUTINE request
      \arg        DMA_REQUEST_ADC0INSERTED0: DMAMUX ADC0INSERTED0 request
      \arg        DMA_REQUEST_ADC0INSERTED1: DMAMUX ADC0INSERTED1 request
      \arg        DMA_REQUEST_ADC0INSERTED2: DMAMUX ADC0INSERTED2 request
      \arg        DMA_REQUEST_ADC0INSERTED3: DMAMUX ADC0INSERTED3 request
      \arg        DMA_REQUEST_ADC0INSERTED4: DMAMUX ADC0INSERTED4 request
      \arg        DMA_REQUEST_ADC0INSERTED5: DMAMUX ADC0INSERTED5 request
      \arg        DMA_REQUEST_ADC1ROUTINE: DMAMUX ADC1ROUTINE request
      \arg        DMA_REQUEST_ADC1INSERTED0: DMAMUX ADC1INSERTED0 request
      \arg        DMA_REQUEST_ADC1INSERTED1: DMAMUX ADC1INSERTED1 request
      \arg        DMA_REQUEST_ADC1INSERTED2: DMAMUX ADC1INSERTED2 request
      \arg        DMA_REQUEST_ADC1INSERTED3: DMAMUX ADC1INSERTED3 request
      \arg        DMA_REQUEST_ADC1INSERTED4: DMAMUX ADC1INSERTED4 request
      \arg        DMA_REQUEST_ADC1INSERTED5: DMAMUX ADC1INSERTED5 request
      \arg        DMA_REQUEST_ADC2ROUTINE: DMAMUX ADC2ROUTINE request
      \arg        DMA_REQUEST_ADC2INSERTED0: DMAMUX ADC2INSERTED0 request
      \arg        DMA_REQUEST_ADC2INSERTED1: DMAMUX ADC2INSERTED1 request
      \arg        DMA_REQUEST_ADC2INSERTED2: DMAMUX ADC2INSERTED2 request
      \arg        DMA_REQUEST_ADC2INSERTED3: DMAMUX ADC2INSERTED3 request
      \arg        DMA_REQUEST_ADC2INSERTED4: DMAMUX ADC2INSERTED4 request
      \arg        DMA_REQUEST_ADC2INSERTED5: DMAMUX ADC2INSERTED5 request
      \arg        DMA_REQUEST_TIMER5_UP1: DMAMUX TIMER5 UP1 request
      \arg        DMA_REQUEST_TIMER5_UP2: DMAMUX TIMER5 UP2 request
      \arg        DMA_REQUEST_TIMER5_UP3: DMAMUX TIMER5 UP3 request
      \arg        DMA_REQUEST_TIMER6_UP1: DMAMUX TIMER6 UP1 request
      \arg        DMA_REQUEST_TIMER6_UP2: DMAMUX TIMER6 UP2 request
      \arg        DMA_REQUEST_TIMER6_UP3: DMAMUX TIMER6 UP3 request
      \arg        DMA_REQUEST_DTM_CAN2_RX0: DMAMUX DTM_CAN2_RX0 request
      \arg        DMA_REQUEST_DTM_CAN2_RX1: DMAMUX DTM_CAN2_RX1 request
      \arg        DMA_REQUEST_DTM_CAN2_TX: DMAMUX DTM_CAN2_TX request
      \arg        DMA_REQUEST_DTM_CAN2_TXE: DMAMUX DTM_CAN2_TXE request
      \arg        DMA_REQUEST_DTM_CAN3_RX0: DMAMUX DTM_CAN3_RX0 request
      \arg        DMA_REQUEST_DTM_CAN3_RX1: DMAMUX DTM_CAN3_RX1 request
      \arg        DMA_REQUEST_DTM_CAN3_TX: DMAMUX DTM_CAN3_TX request
      \arg        DMA_REQUEST_DTM_CAN3_TXE: DMAMUX DTM_CAN3_TXE request
      \arg        DMA_REQUEST_DTM_CAN4_RX0: DMAMUX DTM_CAN4_RX0 request
      \arg        DMA_REQUEST_DTM_CAN4_RX1: DMAMUX DTM_CAN4_RX1 request
      \arg        DMA_REQUEST_DTM_CAN4_TX: DMAMUX DTM_CAN4_TX request
      \arg        DMA_REQUEST_DTM_CAN4_TXE: DMAMUX DTM_CAN4_TXE request
      \arg        DMA_REQUEST_DTM_CAN5_RX0: DMAMUX DTM_CAN5_RX0 request
      \arg        DMA_REQUEST_DTM_CAN5_RX1: DMAMUX DTM_CAN5_RX1 request
      \arg        DMA_REQUEST_DTM_CAN5_TX: DMAMUX DTM_CAN5_TX request
      \arg        DMA_REQUEST_DTM_CAN5_TXE: DMAMUX DTM_CAN5_TXE request
      \arg        DMA_REQUEST_DTM_CAN6_RX0: DMAMUX DTM_CAN6_RX0 request
      \arg        DMA_REQUEST_DTM_CAN6_RX1: DMAMUX DTM_CAN6_RX1 request
      \arg        DMA_REQUEST_DTM_CAN6_TX: DMAMUX DTM_CAN6_TX request
      \arg        DMA_REQUEST_DTM_CAN6_TXE: DMAMUX DTM_CAN6_TXE request
      \arg        DMA_REQUEST_DTM_CAN7_RX0: DMAMUX DTM_CAN7_RX0 request
      \arg        DMA_REQUEST_DTM_CAN7_RX1: DMAMUX DTM_CAN7_RX1 request
      \arg        DMA_REQUEST_DTM_CAN7_TX: DMAMUX DTM_CAN7_TX request
      \arg        DMA_REQUEST_DTM_CAN7_TXE: DMAMUX DTM_CAN7_TXE request
    \param[out] none
    \retval     none
*/
void dmamux_request_id_config(dmamux_multiplexer_channel_enum channelx, uint32_t id)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_MULTIPLEXER_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0043U), ERR_PARAM_INVALID);
    } else if(NOT_DMA_REQUEST(id)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0043U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_MUXID;
        DMAMUX_RM_CHXCFG(channelx) |= id;
    }
}

/*!
    \brief      configure trigger input polarity (API_ID(0x0044U))
    \param[in]  channelx: specify which DMAMUX request generator channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[in]  polarity: trigger input polarity
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GEN_NO_EVENT: no event detection
      \arg        DMAMUX_GEN_RISING: rising edge
      \arg        DMAMUX_GEN_FALLING: falling edge
      \arg        DMAMUX_GEN_RISING_FALLING: rising and falling edges
    \param[out] none
    \retval     none
*/
void dmamux_trigger_polarity_config(dmamux_generator_channel_enum channelx, uint32_t polarity)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_GENERATOR_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0044U), ERR_PARAM_INVALID);
    } else if(NOT_DMAMUX_TRIGGER_POLARITY(polarity)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0044U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RG_CHXCFG(channelx) &= ~DMAMUX_RG_CHXCFG_RGTP;
        DMAMUX_RG_CHXCFG(channelx) |= polarity;
    }
}

/*!
    \brief      configure number of DMA requests to be generated (API_ID(0x0045U))
    \param[in]  channelx: specify which DMAMUX request generator channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[in]  number: DMA requests number to be generated
      \arg        1 - 32
    \param[out] none
    \retval     none
*/
void dmamux_request_generate_number_config(dmamux_generator_channel_enum channelx, uint32_t number)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_GENERATOR_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0045U), ERR_PARAM_INVALID);
    } else if(NOT_DMAMUX_REQUEST_NUMBER(number)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0045U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RG_CHXCFG(channelx) &= ~DMAMUX_RG_CHXCFG_NBRG;
        DMAMUX_RG_CHXCFG(channelx) |= ((number - 1U) << RG_CHXCFG_NBRG_OFFSET);
    }
}

/*!
    \brief      configure trigger input identification (API_ID(0x0046U))
    \param[in]  channelx: specify which DMAMUX request generator channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[in]  id: trigger input identification
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_TRIGGER_EXTI0      : trigger input is EXTI0
      \arg        DMAMUX_TRIGGER_EXTI1      : trigger input is EXTI1
      \arg        DMAMUX_TRIGGER_EXTI2      : trigger input is EXTI2
      \arg        DMAMUX_TRIGGER_EXTI3      : trigger input is EXTI3
      \arg        DMAMUX_TRIGGER_EXTI4      : trigger input is EXTI4
      \arg        DMAMUX_TRIGGER_EXTI5      : trigger input is EXTI5
      \arg        DMAMUX_TRIGGER_EXTI6      : trigger input is EXTI6
      \arg        DMAMUX_TRIGGER_EXTI7      : trigger input is EXTI7
      \arg        DMAMUX_TRIGGER_EXTI8      : trigger input is EXTI8
      \arg        DMAMUX_TRIGGER_EXTI9      : trigger input is EXTI9
      \arg        DMAMUX_TRIGGER_EXTI10     : trigger input is EXTI10
      \arg        DMAMUX_TRIGGER_EXTI11     : trigger input is EXTI11
      \arg        DMAMUX_TRIGGER_EXTI12     : trigger input is EXTI12
      \arg        DMAMUX_TRIGGER_EXTI13     : trigger input is EXTI13
      \arg        DMAMUX_TRIGGER_EXTI14     : trigger input is EXTI14
      \arg        DMAMUX_TRIGGER_EXTI15     : trigger input is EXTI15
      \arg        DMAMUX_TRIGGER_EVT0_OUT   : trigger input is Evt0_out
      \arg        DMAMUX_TRIGGER_EVT1_OUT   : trigger input is Evt1_out
      \arg        DMAMUX_TRIGGER_EVT2_OUT   : trigger input is Evt2_out
      \arg        DMAMUX_TRIGGER_EVT3_OUT   : trigger input is Evt3_out
      \arg        DMAMUX_TRIGGER_EVT4_OUT   : trigger input is Evt4_out
      \arg        DMAMUX_TRIGGER_EVT5_OUT   : trigger input is Evt5_out
      \arg        DMAMUX_TRIGGER_EVT6_OUT   : trigger input is Evt6_out
      \arg        DMAMUX_TRIGGER_EVT7_OUT   : trigger input is Evt7_out
                  DMAMUX_TRIGGER_TIMER1_TRGO: trigger input is TIMER1 TRGO
    \param[out] none
    \retval     none
*/
void dmamux_trigger_id_config(dmamux_generator_channel_enum channelx, uint32_t id)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_GENERATOR_CHANNEL(channelx)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0046U), ERR_PARAM_INVALID);
    } else if(NOT_DMAMUX_TRIGGER_ID(id)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0046U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_RG_CHXCFG(channelx) &= ~DMAMUX_RG_CHXCFG_TID;
        DMAMUX_RG_CHXCFG(channelx) |= id;
    }
}

