sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
/*!
    \brief      get DMAMUX flag (API_ID(0x0047U))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_FLAG_MUXCH0_SO: DMAMUX request multiplexer channel 0 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH1_SO: DMAMUX request multiplexer channel 1 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH2_SO: DMAMUX request multiplexer channel 2 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH3_SO: DMAMUX request multiplexer channel 3 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH4_SO: DMAMUX request multiplexer channel 4 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH5_SO: DMAMUX request multiplexer channel 5 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH6_SO: DMAMUX request multiplexer channel 6 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH7_SO: DMAMUX request multiplexer channel 7 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH8_SO: DMAMUX request multiplexer channel 8 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH9_SO: DMAMUX request multiplexer channel 9 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH10_SO: DMAMUX request multiplexer channel 10 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH11_SO: DMAMUX request multiplexer channel 11 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH12_SO: DMAMUX request multiplexer channel 12 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH13_SO: DMAMUX request multiplexer channel 13 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH14_SO: DMAMUX request multiplexer channel 14 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH15_SO: DMAMUX request multiplexer channel 15 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH16_SO: DMAMUX request multiplexer channel 16 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH17_SO: DMAMUX request multiplexer channel 17 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH18_SO: DMAMUX request multiplexer channel 18 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH19_SO: DMAMUX request multiplexer channel 19 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH20_SO: DMAMUX request multiplexer channel 20 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH21_SO: DMAMUX request multiplexer channel 21 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH22_SO: DMAMUX request multiplexer channel 22 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH23_SO: DMAMUX request multiplexer channel 23 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH24_SO: DMAMUX request multiplexer channel 24 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH25_SO: DMAMUX request multiplexer channel 25 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH26_SO: DMAMUX request multiplexer channel 26 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH27_SO: DMAMUX request multiplexer channel 27 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH28_SO: DMAMUX request multiplexer channel 28 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH29_SO: DMAMUX request multiplexer channel 29 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH30_SO: DMAMUX request multiplexer channel 30 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH31_SO: DMAMUX request multiplexer channel 31 synchronization overrun flag
      \arg        DMAMUX_FLAG_GENCH0_TO: DMAMUX request generator channel 0 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH1_TO: DMAMUX request generator channel 1 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH2_TO: DMAMUX request generator channel 2 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH3_TO: DMAMUX request generator channel 3 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH4_TO: DMAMUX request generator channel 4 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH5_TO: DMAMUX request generator channel 5 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH6_TO: DMAMUX request generator channel 6 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH7_TO: DMAMUX request generator channel 7 trigger overrun flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dmamux_flag_get(dmamux_flag_enum flag)
{
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_FLAG(flag)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0047U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (DMAMUX_REG_VAL(flag) & BIT(DMAMUX_BIT_POS(flag)))) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear DMAMUX flag (API_ID(0x0048U))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_FLAG_MUXCH0_SO: DMAMUX request multiplexer channel 0 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH1_SO: DMAMUX request multiplexer channel 1 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH2_SO: DMAMUX request multiplexer channel 2 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH3_SO: DMAMUX request multiplexer channel 3 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH4_SO: DMAMUX request multiplexer channel 4 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH5_SO: DMAMUX request multiplexer channel 5 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH6_SO: DMAMUX request multiplexer channel 6 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH7_SO: DMAMUX request multiplexer channel 7 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH8_SO: DMAMUX request multiplexer channel 8 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH9_SO: DMAMUX request multiplexer channel 9 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH10_SO: DMAMUX request multiplexer channel 10 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH11_SO: DMAMUX request multiplexer channel 11 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH12_SO: DMAMUX request multiplexer channel 12 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH13_SO: DMAMUX request multiplexer channel 13 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH14_SO: DMAMUX request multiplexer channel 14 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH15_SO: DMAMUX request multiplexer channel 15 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH16_SO: DMAMUX request multiplexer channel 16 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH17_SO: DMAMUX request multiplexer channel 17 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH18_SO: DMAMUX request multiplexer channel 18 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH19_SO: DMAMUX request multiplexer channel 19 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH20_SO: DMAMUX request multiplexer channel 20 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH21_SO: DMAMUX request multiplexer channel 21 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH22_SO: DMAMUX request multiplexer channel 22 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH23_SO: DMAMUX request multiplexer channel 23 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH24_SO: DMAMUX request multiplexer channel 24 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH25_SO: DMAMUX request multiplexer channel 25 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH26_SO: DMAMUX request multiplexer channel 26 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH27_SO: DMAMUX request multiplexer channel 27 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH28_SO: DMAMUX request multiplexer channel 28 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH29_SO: DMAMUX request multiplexer channel 29 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH30_SO: DMAMUX request multiplexer channel 30 synchronization overrun flag
      \arg        DMAMUX_FLAG_MUXCH31_SO: DMAMUX request multiplexer channel 31 synchronization overrun flag
      \arg        DMAMUX_FLAG_GENCH0_TO: DMAMUX request generator channel 0 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH1_TO: DMAMUX request generator channel 1 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH2_TO: DMAMUX request generator channel 2 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH3_TO: DMAMUX request generator channel 3 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH4_TO: DMAMUX request generator channel 4 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH5_TO: DMAMUX request generator channel 5 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH6_TO: DMAMUX request generator channel 6 trigger overrun flag
      \arg        DMAMUX_FLAG_GENCH7_TO: DMAMUX request generator channel 7 trigger overrun flag
    \param[out] none
    \retval     none
*/
void dmamux_flag_clear(dmamux_flag_enum flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_FLAG(flag)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0048U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_REG_VAL3(flag) = BIT(DMAMUX_BIT_POS(flag));
    }
}

/*!
    \brief      enable DMAMUX interrupt (API_ID(0x0049U))
    \param[in]  interrupt: specify which interrupt to enable
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_INT_MUXCH0_SO: DMAMUX request multiplexer channel 0 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH1_SO: DMAMUX request multiplexer channel 1 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH2_SO: DMAMUX request multiplexer channel 2 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH3_SO: DMAMUX request multiplexer channel 3 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH4_SO: DMAMUX request multiplexer channel 4 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH5_SO: DMAMUX request multiplexer channel 5 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH6_SO: DMAMUX request multiplexer channel 6 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH7_SO: DMAMUX request multiplexer channel 7 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH8_SO: DMAMUX request multiplexer channel 8 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH9_SO: DMAMUX request multiplexer channel 9 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH10_SO: DMAMUX request multiplexer channel 10 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH11_SO: DMAMUX request multiplexer channel 11 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH12_SO: DMAMUX request multiplexer channel 12 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH13_SO: DMAMUX request multiplexer channel 13 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH14_SO: DMAMUX request multiplexer channel 14 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH15_SO: DMAMUX request multiplexer channel 15 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH16_SO: DMAMUX request multiplexer channel 16 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH17_SO: DMAMUX request multiplexer channel 17 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH18_SO: DMAMUX request multiplexer channel 18 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH19_SO: DMAMUX request multiplexer channel 19 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH20_SO: DMAMUX request multiplexer channel 20 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH21_SO: DMAMUX request multiplexer channel 21 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH22_SO: DMAMUX request multiplexer channel 22 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH23_SO: DMAMUX request multiplexer channel 23 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH24_SO: DMAMUX request multiplexer channel 24 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH25_SO: DMAMUX request multiplexer channel 25 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH26_SO: DMAMUX request multiplexer channel 26 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH27_SO: DMAMUX request multiplexer channel 27 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH28_SO: DMAMUX request multiplexer channel 28 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH29_SO: DMAMUX request multiplexer channel 29 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH30_SO: DMAMUX request multiplexer channel 30 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH31_SO: DMAMUX request multiplexer channel 31 synchronization overrun interrupt
      \arg        DMAMUX_INT_GENCH0_TO: DMAMUX request generator channel 0 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH1_TO: DMAMUX request generator channel 1 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH2_TO: DMAMUX request generator channel 2 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH3_TO: DMAMUX request generator channel 3 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH4_TO: DMAMUX request generator channel 4 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH5_TO: DMAMUX request generator channel 5 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH6_TO: DMAMUX request generator channel 6 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH7_TO: DMAMUX request generator channel 7 trigger overrun interrupt
    \param[out] none
    \retval     none
*/
void dmamux_interrupt_enable(dmamux_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_INTERRUPT(interrupt)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0049U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_REG_VAL(interrupt) |= BIT(DMAMUX_BIT_POS(interrupt));
    }
}

/*!
    \brief      disable DMAMUX interrupt (API_ID(0x004AU))
    \param[in]  interrupt: specify which interrupt to disable
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_INT_MUXCH0_SO: DMAMUX request multiplexer channel 0 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH1_SO: DMAMUX request multiplexer channel 1 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH2_SO: DMAMUX request multiplexer channel 2 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH3_SO: DMAMUX request multiplexer channel 3 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH4_SO: DMAMUX request multiplexer channel 4 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH5_SO: DMAMUX request multiplexer channel 5 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH6_SO: DMAMUX request multiplexer channel 6 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH7_SO: DMAMUX request multiplexer channel 7 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH8_SO: DMAMUX request multiplexer channel 8 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH9_SO: DMAMUX request multiplexer channel 9 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH10_SO: DMAMUX request multiplexer channel 10 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH11_SO: DMAMUX request multiplexer channel 11 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH12_SO: DMAMUX request multiplexer channel 12 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH13_SO: DMAMUX request multiplexer channel 13 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH14_SO: DMAMUX request multiplexer channel 14 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH15_SO: DMAMUX request multiplexer channel 15 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH16_SO: DMAMUX request multiplexer channel 16 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH17_SO: DMAMUX request multiplexer channel 17 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH18_SO: DMAMUX request multiplexer channel 18 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH19_SO: DMAMUX request multiplexer channel 19 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH20_SO: DMAMUX request multiplexer channel 20 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH21_SO: DMAMUX request multiplexer channel 21 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH22_SO: DMAMUX request multiplexer channel 22 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH23_SO: DMAMUX request multiplexer channel 23 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH24_SO: DMAMUX request multiplexer channel 24 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH25_SO: DMAMUX request multiplexer channel 25 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH26_SO: DMAMUX request multiplexer channel 26 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH27_SO: DMAMUX request multiplexer channel 27 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH28_SO: DMAMUX request multiplexer channel 28 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH29_SO: DMAMUX request multiplexer channel 29 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH30_SO: DMAMUX request multiplexer channel 30 synchronization overrun interrupt
      \arg        DMAMUX_INT_MUXCH31_SO: DMAMUX request multiplexer channel 31 synchronization overrun interrupt
      \arg        DMAMUX_INT_GENCH0_TO: DMAMUX request generator channel 0 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH1_TO: DMAMUX request generator channel 1 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH2_TO: DMAMUX request generator channel 2 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH3_TO: DMAMUX request generator channel 3 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH4_TO: DMAMUX request generator channel 4 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH5_TO: DMAMUX request generator channel 5 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH6_TO: DMAMUX request generator channel 6 trigger overrun interrupt
      \arg        DMAMUX_INT_GENCH7_TO: DMAMUX request generator channel 7 trigger overrun interrupt
    \param[out] none
    \retval     none
*/
void dmamux_interrupt_disable(dmamux_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_INTERRUPT(interrupt)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x004AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_REG_VAL(interrupt) &= ~BIT(DMAMUX_BIT_POS(interrupt));
    }
}

