sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.c
/*!
    \brief      get DMAMUX interrupt flag (API_ID(0x004BU))
    \param[in]  int_flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_INT_FLAG_MUXCH0_SO: DMAMUX request multiplexer channel 0 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH1_SO: DMAMUX request multiplexer channel 1 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH2_SO: DMAMUX request multiplexer channel 2 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH3_SO: DMAMUX request multiplexer channel 3 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH4_SO: DMAMUX request multiplexer channel 4 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH5_SO: DMAMUX request multiplexer channel 5 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH6_SO: DMAMUX request multiplexer channel 6 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH7_SO: DMAMUX request multiplexer channel 7 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH8_SO: DMAMUX request multiplexer channel 8 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH9_SO: DMAMUX request multiplexer channel 9 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH10_SO: DMAMUX request multiplexer channel 10 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH11_SO: DMAMUX request multiplexer channel 11 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH12_SO: DMAMUX request multiplexer channel 12 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH13_SO: DMAMUX request multiplexer channel 13 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH14_SO: DMAMUX request multiplexer channel 14 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH15_SO: DMAMUX request multiplexer channel 15 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH16_SO: DMAMUX request multiplexer channel 16 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH17_SO: DMAMUX request multiplexer channel 17 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH18_SO: DMAMUX request multiplexer channel 18 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH19_SO: DMAMUX request multiplexer channel 19 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH20_SO: DMAMUX request multiplexer channel 20 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH21_SO: DMAMUX request multiplexer channel 21 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH22_SO: DMAMUX request multiplexer channel 22 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH23_SO: DMAMUX request multiplexer channel 23 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH24_SO: DMAMUX request multiplexer channel 24 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH25_SO: DMAMUX request multiplexer channel 25 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH26_SO: DMAMUX request multiplexer channel 26 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH27_SO: DMAMUX request multiplexer channel 27 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH28_SO: DMAMUX request multiplexer channel 28 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH29_SO: DMAMUX request multiplexer channel 29 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH30_SO: DMAMUX request multiplexer channel 30 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH31_SO: DMAMUX request multiplexer channel 31 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH0_TO: DMAMUX request generator channel 0 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH1_TO: DMAMUX request generator channel 1 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH2_TO: DMAMUX request generator channel 2 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH3_TO: DMAMUX request generator channel 3 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH4_TO: DMAMUX request generator channel 4 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH5_TO: DMAMUX request generator channel 5 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH6_TO: DMAMUX request generator channel 6 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH7_TO: DMAMUX request generator channel 7 trigger overrun interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dmamux_interrupt_flag_get(dmamux_interrupt_flag_enum int_flag)
{
    FlagStatus reval = RESET;
    uint32_t intenable, flagstatus;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_INTERRUPT_FLAG(int_flag)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x004BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the interrupt enable bit status */
        intenable = (DMAMUX_REG_VAL2(int_flag) & BIT(DMAMUX_BIT_POS2(int_flag)));
        /* get the corresponding flag bit status */
        flagstatus = (DMAMUX_REG_VAL(int_flag) & BIT(DMAMUX_BIT_POS(int_flag)));

        if((0U != flagstatus) && (0U != intenable)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear DMAMUX interrupt flag (API_ID(0x004CU))
    \param[in]  int_flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_INT_FLAG_MUXCH0_SO: DMAMUX request multiplexer channel 0 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH1_SO: DMAMUX request multiplexer channel 1 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH2_SO: DMAMUX request multiplexer channel 2 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH3_SO: DMAMUX request multiplexer channel 3 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH4_SO: DMAMUX request multiplexer channel 4 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH5_SO: DMAMUX request multiplexer channel 5 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH6_SO: DMAMUX request multiplexer channel 6 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH7_SO: DMAMUX request multiplexer channel 7 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH8_SO: DMAMUX request multiplexer channel 8 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH9_SO: DMAMUX request multiplexer channel 9 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH10_SO: DMAMUX request multiplexer channel 10 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH11_SO: DMAMUX request multiplexer channel 11 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH12_SO: DMAMUX request multiplexer channel 12 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH13_SO: DMAMUX request multiplexer channel 13 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH14_SO: DMAMUX request multiplexer channel 14 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH15_SO: DMAMUX request multiplexer channel 15 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH16_SO: DMAMUX request multiplexer channel 16 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH17_SO: DMAMUX request multiplexer channel 17 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH18_SO: DMAMUX request multiplexer channel 18 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH19_SO: DMAMUX request multiplexer channel 19 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH20_SO: DMAMUX request multiplexer channel 20 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH21_SO: DMAMUX request multiplexer channel 21 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH22_SO: DMAMUX request multiplexer channel 22 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH23_SO: DMAMUX request multiplexer channel 23 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH24_SO: DMAMUX request multiplexer channel 24 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH25_SO: DMAMUX request multiplexer channel 25 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH26_SO: DMAMUX request multiplexer channel 26 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH27_SO: DMAMUX request multiplexer channel 27 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH28_SO: DMAMUX request multiplexer channel 28 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH29_SO: DMAMUX request multiplexer channel 29 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH30_SO: DMAMUX request multiplexer channel 30 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_MUXCH31_SO: DMAMUX request multiplexer channel 31 synchronization overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH0_TO: DMAMUX request generator channel 0 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH1_TO: DMAMUX request generator channel 1 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH2_TO: DMAMUX request generator channel 2 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH3_TO: DMAMUX request generator channel 3 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH4_TO: DMAMUX request generator channel 4 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH5_TO: DMAMUX request generator channel 5 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH6_TO: DMAMUX request generator channel 6 trigger overrun interrupt flag
      \arg        DMAMUX_INT_FLAG_GENCH7_TO: DMAMUX request generator channel 7 trigger overrun interrupt flag
    \param[out] none
    \retval     none
*/
void dmamux_interrupt_flag_clear(dmamux_interrupt_flag_enum int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DMAMUX_INTERRUPT_FLAG(int_flag)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x004CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DMAMUX_REG_VAL3(int_flag) = BIT(DMAMUX_BIT_POS(int_flag));
    }
}
